-- -*-mode: M2-*-
+ M2 --no-readline --print-width 98
Macaulay2, version 1.9.2
with packages: ConwayPolynomials, Elimination, IntegralClosure, LLLBases, PrimaryDecomposition,
               ReesAlgebra, TangentCone

i1 : ----------------------------------------------------------------------
     -- MACAULAY2 CODE TO COMPUTE THE HIDDEN RELATION VIA THE MODULI MAP --
     ----------------------------------------------------------------------
     -- Hidden relation in terms of t_0..t_2,d_0..d_2, and L=\Lambda=\prod \lambda_k 
     -- We first work with the variable X that represents X=-(d_0*d_1+d_1*d_2+d_2*d_0)/L
     -- After obtaining a relation in terms of X we convert we substitute L in
     -- The final polynomial is H = H0+H1*L+H2*L^2
     printWidth=120; gbTrace=3;

i3 : -- We start with the following rings:
     kk = QQ

o3 = QQ

o3 : Ring

i4 : R = kk[a_0..a_5]

   -- registering polynomial ring 0 at 0xb508b28

   -- registering polynomial ring 1 at 0xb508990

   -- registering polynomial ring 2 at 0xb5087f8

o4 = R

o4 : PolynomialRing

i5 : S = kk[t_0..t_2,d_0..d_2,X,L,Degrees=>{1,1,1,2,2,2,4,0}]

   -- registering polynomial ring 3 at 0xb508220

o5 = S

o5 : PolynomialRing

i6 : -- Formulas for the traces
     T_0 = -a_0-a_5

o6 = - a  - a
        0    5

o6 : R

i7 : T_1 = a_0+a_4-a_5

o7 = a  + a  - a
      0    4    5

o7 : R

i8 : T_2 = -a_0+a_1+a_5

o8 = - a  + a  + a
        0    1    5

o8 : R

i9 : -- Formulas for the determinants
     D_0 = -a_2*a_3+a_0*a_5

o9 = - a a  + a a
        2 3    0 5

o9 : R

i10 : D_1 = -a_1*a_3+a_2*a_3+a_0*a_4-a_0*a_5

o10 = - a a  + a a  + a a  - a a
         1 3    2 3    0 4    0 5

o10 : R

i11 : D_2 = a_2*a_3-a_2*a_4-a_0*a_5+a_1*a_5

o11 = a a  - a a  - a a  + a a
       2 3    2 4    0 5    1 5

o11 : R

i12 : -- Explicit formula for X
      x = 4*a_0^3*a_2-a_0^2*a_1^2+2*a_0^2*a_1*a_5-12*a_0^2*a_2*a_4-a_0^2*a_5^2+2*a_0*a_1^2*a_4+18*a_0*a_1*a_2*a_3-4*a_0*a_1*a_4*a_5-18*a_0*a_2*a_3*a_5+12*a_0*a_2*a_4^2+2*a_0*a_4*a_5^2-4*a_1^3*a_3+12*a_1^2*a_3*a_5-a_1^2*a_4^2-18*a_1*a_2*a_3*a_4-12*a_1*a_3*a_5^2+2*a_1*a_4^2*a_5+27*a_2^2*a_3^2+18*a_2*a_3*a_4*a_5-4*a_2*a_4^3+4*a_3*a_5^3-a_4^2*a_5^2;

i13 : -- The list ls defines a function F:R<---S
      ls = {T_0,T_1,T_2,D_0,D_1,D_2,x,0};

i14 : F = map(R,S,ls);

o14 : RingMap R <--- S

i15 : -- Main computations
      time G = gens kernel F;

   -- registering polynomial ring 4 at 0xb56d330

   -- registering gb 0 at 0xb5134c0

   -- [gb]{1}(4)mmmm{2}(3)mmm{3}(2)mm{4}(5)mooom{5}(4)mmoo{6}(5)moooo{7}(5)moooo
   -- {8}(3)ooo{9}(1)m{10}(4)mooo{11}(4)mooo{12}(5)mmooo{13}(8)mooooooo{14}(4)oooonumber of (nonminimal) gb elements = 21
   -- number of monomials                = 7194
   -- #reduction steps = 25510
   -- #spairs done = 2161
   -- ncalls = 17
   -- nloop = 104
   -- nsaved = 0
   --      -- used 1.13956 seconds

              1       2
o15 : Matrix S  <--- S

i16 : -- The kernel of F is generated by a polynomial p (and L, since everything lives in the hyperplane L=0)
      G_(0,0) == L

o16 = true

i17 : p = G_(0,1);

i18 : -- The following are the coefficients of p as a function of X; p=AX^2+BX+C:
      A = substitute(diff(X,diff(X,p/2)),{X=>0});

i19 : B = substitute(diff(X,p),{X=>0});

i20 : C = substitute(p,{X=>0});

i21 : -- The coefficients of the Hidden relation in our family are:
      H0 = A*(d_0*d_1+d_1*d_2+d_2*d_0)^2;

i22 : H1 = -B*(d_0*d_1+d_1*d_2+d_2*d_0);

i23 : H2 = C;

i24 : -- The hiden relation
      H = H0+H1*L+H2*L^2

       2 6 3 2     2 5   3 2      2 4 2 3 2      2 3 3 3 2      2 2 4 3 2     2   5 3 2    2 6 3 2    4 4 2   2  
o24 = t t d L  - 6t t t d L  + 15t t t d L  - 20t t t d L  + 15t t t d L  - 6t t t d L  + t t d L  + t t d d L  +
       0 1 0       0 1 2 0        0 1 2 0        0 1 2 0        0 1 2 0       0 1 2 0      0 2 0      0 1 0 1    
      ------------------------------------------------------------------------------------------------------------------
        3 5 2   2     4 3   2   2      3 4   2   2     2 5   2   2     4 2 2 2   2      3 3 2 2   2      2 4 2 2   2  
      2t t d d L  - 4t t t d d L  - 10t t t d d L  - 4t t t d d L  + 6t t t d d L  + 20t t t d d L  + 17t t t d d L  +
        0 1 0 1       0 1 2 0 1        0 1 2 0 1       0 1 2 0 1       0 1 2 0 1        0 1 2 0 1        0 1 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
          5 2 2   2     4   3 2   2      3 2 3 2   2      2 3 3 2   2       4 3 2   2    4 4 2   2      3   4 2   2  
      2t t t d d L  - 4t t t d d L  - 20t t t d d L  - 28t t t d d L  - 8t t t d d L  + t t d d L  + 10t t t d d L  +
        0 1 2 0 1       0 1 2 0 1        0 1 2 0 1        0 1 2 0 1       0 1 2 0 1      0 2 0 1        0 1 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
         2 2 4 2   2        3 4 2   2     3 5 2   2     2   5 2   2       2 5 2   2    2 6 2   2         6 2   2  
      22t t t d d L  + 12t t t d d L  - 2t t d d L  - 8t t t d d L  - 8t t t d d L  + t t d d L  + 2t t t d d L  +
         0 1 2 0 1        0 1 2 0 1       0 2 0 1       0 1 2 0 1       0 1 2 0 1      0 2 0 1       0 1 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
        5 3   2 2    4 4   2 2     5 2     2 2      4 3     2 2     3 4     2 2     5   2   2 2      4 2 2   2 2  
      2t t d d L  + t t d d L  - 4t t t d d L  - 10t t t d d L  - 4t t t d d L  + 2t t t d d L  + 17t t t d d L  +
        0 1 0 1      0 1 0 1       0 1 2 0 1        0 1 2 0 1       0 1 2 0 1       0 1 2 0 1        0 1 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
         3 3 2   2 2     2 4 2   2 2     4   3   2 2      3 2 3   2 2      2 3 3   2 2       4 3   2 2      3   4   2 2
      20t t t d d L  + 6t t t d d L  - 8t t t d d L  - 28t t t d d L  - 20t t t d d L  - 4t t t d d L  + 12t t t d d L 
         0 1 2 0 1       0 1 2 0 1       0 1 2 0 1        0 1 2 0 1        0 1 2 0 1       0 1 2 0 1        0 1 2 0 1  
      ------------------------------------------------------------------------------------------------------------------
           2 2 4   2 2        3 4   2 2    4 4   2 2     2   5   2 2       2 5   2 2     3 5   2 2         6   2 2  
      + 22t t t d d L  + 10t t t d d L  + t t d d L  - 8t t t d d L  - 8t t t d d L  - 2t t d d L  + 2t t t d d L  +
           0 1 2 0 1        0 1 2 0 1      1 2 0 1       0 1 2 0 1       0 1 2 0 1       1 2 0 1       0 1 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
       2 6   2 2    6 2 3 2     5 2   3 2      4 2 2 3 2      3 2 3 3 2      2 2 4 3 2       2 5 3 2    2 6 3 2  
      t t d d L  + t t d L  - 6t t t d L  + 15t t t d L  - 20t t t d L  + 15t t t d L  - 6t t t d L  + t t d L  +
       1 2 0 1      0 1 1       0 1 2 1        0 1 2 1        0 1 2 1        0 1 2 1       0 1 2 1      1 2 1    
      ------------------------------------------------------------------------------------------------------------------
       4 4 2   2     3 5 2   2    2 6 2   2     4 3   2   2      3 4   2   2     2 5   2   2       6   2   2  
      t t d d L  - 2t t d d L  + t t d d L  - 4t t t d d L  + 10t t t d d L  - 8t t t d d L  + 2t t t d d L  +
       0 1 0 2       0 1 0 2      0 1 0 2       0 1 2 0 2        0 1 2 0 2       0 1 2 0 2       0 1 2 0 2    
      ------------------------------------------------------------------------------------------------------------------
        4 2 2 2   2      3 3 2 2   2      2 4 2 2   2       5 2 2   2     4   3 2   2      3 2 3 2   2      2 3 3 2   2
      6t t t d d L  - 20t t t d d L  + 22t t t d d L  - 8t t t d d L  - 4t t t d d L  + 20t t t d d L  - 28t t t d d L 
        0 1 2 0 2        0 1 2 0 2        0 1 2 0 2       0 1 2 0 2       0 1 2 0 2        0 1 2 0 2        0 1 2 0 2  
      ------------------------------------------------------------------------------------------------------------------
             4 3 2   2    4 4 2   2      3   4 2   2      2 2 4 2   2       3 4 2   2     3 5 2   2     2   5 2   2  
      + 12t t t d d L  + t t d d L  - 10t t t d d L  + 17t t t d d L  - 8t t t d d L  + 2t t d d L  - 4t t t d d L  +
           0 1 2 0 2      0 2 0 2        0 1 2 0 2        0 1 2 0 2       0 1 2 0 2       0 2 0 2       0 1 2 0 2    
      ------------------------------------------------------------------------------------------------------------------
          2 5 2   2     5 3       2     4 4       2     3 5       2     5 2         2     4 3         2  
      2t t t d d L  + 2t t d d d L  - 4t t d d d L  + 2t t d d d L  - 2t t t d d d L  + 2t t t d d d L  +
        0 1 2 0 2       0 1 0 1 2       0 1 0 1 2       0 1 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
        3 4         2     2 5         2     5   2       2     4 2 2       2     3 3 2       2     2 4 2       2  
      2t t t d d d L  - 2t t t d d d L  - 2t t t d d d L  + 4t t t d d d L  - 4t t t d d d L  + 4t t t d d d L  -
        0 1 2 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
          5 2       2     5 3       2     4   3       2     3 2 3       2     2 3 3       2       4 3       2  
      2t t t d d d L  + 2t t d d d L  + 2t t t d d d L  - 4t t t d d d L  - 4t t t d d d L  + 2t t t d d d L  +
        0 1 2 0 1 2       0 2 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
        5 3       2     4 4       2     3   4       2     2 2 4       2       3 4       2     4 4       2  
      2t t d d d L  - 4t t d d d L  + 2t t t d d d L  + 4t t t d d d L  + 2t t t d d d L  - 4t t d d d L  +
        1 2 0 1 2       0 2 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2       1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
        3 5       2     2   5       2       2 5       2     3 5       2    6 2 2   2     5 3 2   2    4 4 2   2  
      2t t d d d L  - 2t t t d d d L  - 2t t t d d d L  + 2t t d d d L  + t t d d L  - 2t t d d L  + t t d d L  +
        0 2 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2       1 2 0 1 2      0 1 1 2       0 1 1 2      0 1 1 2    
      ------------------------------------------------------------------------------------------------------------------
        6     2   2     5 2   2   2      4 3   2   2     3 4   2   2     5   2 2   2      4 2 2 2   2      3 3 2 2   2  
      2t t t d d L  - 8t t t d d L  + 10t t t d d L  - 4t t t d d L  - 8t t t d d L  + 22t t t d d L  - 20t t t d d L  +
        0 1 2 1 2       0 1 2 1 2        0 1 2 1 2       0 1 2 1 2       0 1 2 1 2        0 1 2 1 2        0 1 2 1 2    
      ------------------------------------------------------------------------------------------------------------------
        2 4 2 2   2      4   3 2   2      3 2 3 2   2      2 3 3 2   2       4 3 2   2     3   4 2   2      2 2 4 2   2
      6t t t d d L  + 12t t t d d L  - 28t t t d d L  + 20t t t d d L  - 4t t t d d L  - 8t t t d d L  + 17t t t d d L 
        0 1 2 1 2        0 1 2 1 2        0 1 2 1 2        0 1 2 1 2       0 1 2 1 2       0 1 2 1 2        0 1 2 1 2  
      ------------------------------------------------------------------------------------------------------------------
             3 4 2   2    4 4 2   2     2   5 2   2       2 5 2   2     3 5 2   2     5 2     2 2     4 3     2 2  
      - 10t t t d d L  + t t d d L  + 2t t t d d L  - 4t t t d d L  + 2t t d d L  + 2t t t d d L  - 8t t t d d L  +
           0 1 2 1 2      1 2 1 2       0 1 2 1 2       0 1 2 1 2       1 2 1 2       0 1 2 0 2       0 1 2 0 2    
      ------------------------------------------------------------------------------------------------------------------
         3 4     2 2     2 5     2 2       6     2 2     5   2   2 2      4 2 2   2 2      3 3 2   2 2      2 4 2   2 2
      12t t t d d L  - 8t t t d d L  + 2t t t d d L  - 4t t t d d L  + 17t t t d d L  - 28t t t d d L  + 22t t t d d L 
         0 1 2 0 2       0 1 2 0 2       0 1 2 0 2       0 1 2 0 2        0 1 2 0 2        0 1 2 0 2        0 1 2 0 2  
      ------------------------------------------------------------------------------------------------------------------
            5 2   2 2    6 2   2 2     5 3   2 2      4   3   2 2      3 2 3   2 2      2 3 3   2 2        4 3   2 2  
      - 8t t t d d L  + t t d d L  + 2t t d d L  - 10t t t d d L  + 20t t t d d L  - 20t t t d d L  + 10t t t d d L  -
          0 1 2 0 2      1 2 0 2       0 2 0 2        0 1 2 0 2        0 1 2 0 2        0 1 2 0 2        0 1 2 0 2    
      ------------------------------------------------------------------------------------------------------------------
        5 3   2 2    4 4   2 2     3   4   2 2     2 2 4   2 2       3 4   2 2    4 4   2 2     6       2 2  
      2t t d d L  + t t d d L  - 4t t t d d L  + 6t t t d d L  - 4t t t d d L  + t t d d L  + 2t t t d d L  -
        1 2 0 2      0 2 0 2       0 1 2 0 2       0 1 2 0 2       0 1 2 0 2      1 2 0 2       0 1 2 1 2    
      ------------------------------------------------------------------------------------------------------------------
        5 2     2 2      4 3     2 2     3 4     2 2     2 5     2 2    6 2   2 2     5   2   2 2      4 2 2   2 2  
      8t t t d d L  + 12t t t d d L  - 8t t t d d L  + 2t t t d d L  + t t d d L  - 8t t t d d L  + 22t t t d d L  -
        0 1 2 1 2        0 1 2 1 2       0 1 2 1 2       0 1 2 1 2      0 2 1 2       0 1 2 1 2        0 1 2 1 2    
      ------------------------------------------------------------------------------------------------------------------
         3 3 2   2 2      2 4 2   2 2       5 2   2 2     5 3   2 2      4   3   2 2      3 2 3   2 2      2 3 3   2 2  
      28t t t d d L  + 17t t t d d L  - 4t t t d d L  - 2t t d d L  + 10t t t d d L  - 20t t t d d L  + 20t t t d d L  -
         0 1 2 1 2        0 1 2 1 2       0 1 2 1 2       0 2 1 2        0 1 2 1 2        0 1 2 1 2        0 1 2 1 2    
      ------------------------------------------------------------------------------------------------------------------
           4 3   2 2     5 3   2 2    4 4   2 2     3   4   2 2     2 2 4   2 2       3 4   2 2    4 4   2 2    6 2 3 2
      10t t t d d L  + 2t t d d L  + t t d d L  - 4t t t d d L  + 6t t t d d L  - 4t t t d d L  + t t d d L  + t t d L 
         0 1 2 1 2       1 2 1 2      0 2 1 2       0 1 2 1 2       0 1 2 1 2       0 1 2 1 2      1 2 1 2      0 2 2  
      ------------------------------------------------------------------------------------------------------------------
          5   2 3 2      4 2 2 3 2      3 3 2 3 2      2 4 2 3 2       5 2 3 2    6 2 3 2     6 4 2      5   4 2  
      - 6t t t d L  + 15t t t d L  - 20t t t d L  + 15t t t d L  - 6t t t d L  + t t d L  - 4t d L  + 24t t d L  -
          0 1 2 2        0 1 2 2        0 1 2 2        0 1 2 2       0 1 2 2      1 2 2       1 0        1 2 0    
      ------------------------------------------------------------------------------------------------------------------
         4 2 4 2      3 3 4 2      2 4 4 2        5 4 2     6 4 2      2 4 3   2       5 3   2       2 3   3   2  
      60t t d L  + 80t t d L  - 60t t d L  + 24t t d L  - 4t d L  - 30t t d d L  - 6t t d d L  + 120t t t d d L  +
         1 2 0        1 2 0        1 2 0        1 2 0       2 0        0 1 0 1       0 1 0 1         0 1 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
           4   3   2      5   3   2       2 2 2 3   2        3 2 3   2      4 2 3   2       2   3 3   2        2 3 3   2
      36t t t d d L  + 24t t d d L  - 180t t t d d L  - 84t t t d d L  - 96t t d d L  + 120t t t d d L  + 96t t t d d L 
         0 1 2 0 1        1 2 0 1         0 1 2 0 1        0 1 2 0 1        1 2 0 1         0 1 2 0 1        0 1 2 0 1  
      ------------------------------------------------------------------------------------------------------------------
            3 3 3   2      2 4 3   2          4 3   2      2 4 3   2        5 3   2        5 3   2      4 2 2 2 2  
      + 144t t d d L  - 30t t d d L  - 54t t t d d L  - 96t t d d L  + 12t t d d L  + 24t t d d L  - 18t t d d L  -
            1 2 0 1        0 2 0 1        0 1 2 0 1        1 2 0 1        0 2 0 1        1 2 0 1        0 1 0 1    
      ------------------------------------------------------------------------------------------------------------------
         3 3 2 2 2      2 4 2 2 2      4     2 2 2       3 2   2 2 2       2 3   2 2 2        4   2 2 2      4 2 2 2 2  
      28t t d d L  - 18t t d d L  + 36t t t d d L  + 120t t t d d L  + 120t t t d d L  + 36t t t d d L  - 18t t d d L  -
         0 1 0 1        0 1 0 1        0 1 2 0 1         0 1 2 0 1         0 1 2 0 1        0 1 2 0 1        0 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
          3   2 2 2 2       2 2 2 2 2 2         3 2 2 2 2      4 2 2 2 2      3 3 2 2 2       2   3 2 2 2  
      156t t t d d L  - 252t t t d d L  - 156t t t d d L  - 18t t d d L  + 64t t d d L  + 216t t t d d L  +
          0 1 2 0 1         0 1 2 0 1         0 1 2 0 1        1 2 0 1        0 2 0 1         0 1 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
            2 3 2 2 2      3 3 2 2 2      2 4 2 2 2           4 2 2 2      2 4 2 2 2        5 2 2 2        5 2 2 2  
      216t t t d d L  + 64t t d d L  - 66t t d d L  - 108t t t d d L  - 66t t d d L  + 12t t d d L  + 12t t d d L  +
          0 1 2 0 1        1 2 0 1        0 2 0 1         0 1 2 0 1        1 2 0 1        0 2 0 1        1 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
        6 2 2 2     5     3 2      4 2   3 2      5     3 2      4       3 2       3 2     3 2      4 2   3 2  
      8t d d L  - 6t t d d L  - 30t t d d L  + 24t t d d L  + 36t t t d d L  + 120t t t d d L  - 96t t d d L  -
        2 0 1       0 1 0 1        0 1 0 1        0 2 0 1        0 1 2 0 1         0 1 2 0 1        0 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
         3   2   3 2       2 2 2   3 2       3 3   3 2      2   3   3 2         2 3   3 2      2 4   3 2  
      84t t t d d L  - 180t t t d d L  + 144t t d d L  + 96t t t d d L  + 120t t t d d L  - 96t t d d L  -
         0 1 2 0 1         0 1 2 0 1         0 2 0 1        0 1 2 0 1         0 1 2 0 1        0 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
             4   3 2      2 4   3 2        5   3 2        5   3 2     6 4 2      5   4 2      4 2 4 2      3 3 4 2  
      54t t t d d L  - 30t t d d L  + 24t t d d L  + 12t t d d L  - 4t d L  + 24t t d L  - 60t t d L  + 80t t d L  -
         0 1 2 0 1        1 2 0 1        0 2 0 1        1 2 0 1       0 1        0 2 1        0 2 1        0 2 1    
      ------------------------------------------------------------------------------------------------------------------
         2 4 4 2        5 4 2     6 4 2      2 4 3   2        5 3   2       2 3   3   2        4   3   2      5   3   2
      60t t d L  + 24t t d L  - 4t d L  - 30t t d d L  + 12t t d d L  + 120t t t d d L  - 54t t t d d L  + 24t t d d L 
         0 2 1        0 2 1       2 1        0 1 0 2        0 1 0 2         0 1 2 0 2        0 1 2 0 2        1 2 0 2  
      ------------------------------------------------------------------------------------------------------------------
            2 2 2 3   2        3 2 3   2      4 2 3   2       2   3 3   2        2 3 3   2       3 3 3   2  
      - 180t t t d d L  + 96t t t d d L  - 96t t d d L  + 120t t t d d L  - 84t t t d d L  + 144t t d d L  -
            0 1 2 0 2        0 1 2 0 2        1 2 0 2         0 1 2 0 2        0 1 2 0 2         1 2 0 2    
      ------------------------------------------------------------------------------------------------------------------
         2 4 3   2          4 3   2      2 4 3   2       5 3   2        5 3   2      4 2 2     2      3 3 2     2  
      30t t d d L  + 36t t t d d L  - 96t t d d L  - 6t t d d L  + 24t t d d L  - 36t t d d d L  + 36t t d d d L  -
         0 2 0 2        0 1 2 0 2        1 2 0 2       0 2 0 2        1 2 0 2        0 1 0 1 2        0 1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
         2 4 2     2        5 2     2      4     2     2      3 2   2     2       2 3   2     2        4   2     2  
      66t t d d d L  + 12t t d d d L  + 72t t t d d d L  - 36t t t d d d L  + 264t t t d d d L  - 72t t t d d d L  +
         0 1 0 1 2        0 1 0 1 2        0 1 2 0 1 2        0 1 2 0 1 2         0 1 2 0 1 2        0 1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
         5   2     2      4 2 2     2      3   2 2     2       2 2 2 2     2        3 2 2     2       4 2 2     2  
      42t t d d d L  - 36t t d d d L  - 36t t t d d d L  - 396t t t d d d L  + 60t t t d d d L  - 132t t d d d L  +
         1 2 0 1 2        0 2 0 1 2        0 1 2 0 1 2         0 1 2 0 1 2        0 1 2 0 1 2         1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
         3 3 2     2       2   3 2     2        2 3 2     2       3 3 2     2      2 4 2     2          4 2     2  
      36t t d d d L  + 264t t t d d d L  + 60t t t d d d L  + 180t t d d d L  - 66t t d d d L  - 72t t t d d d L  -
         0 2 0 1 2         0 1 2 0 1 2        0 1 2 0 1 2         1 2 0 1 2        0 2 0 1 2        0 1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
          2 4 2     2        5 2     2        5 2     2      5     2   2      4 2   2   2      3 3   2   2  
      132t t d d d L  + 12t t d d d L  + 42t t d d d L  + 12t t d d d L  - 66t t d d d L  + 36t t d d d L  -
          1 2 0 1 2        0 2 0 1 2        1 2 0 1 2        0 1 0 1 2        0 1 0 1 2        0 1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
         2 4   2   2      5     2   2      4       2   2       3 2     2   2      2 3     2   2        4     2   2  
      36t t d d d L  + 42t t d d d L  - 72t t t d d d L  + 264t t t d d d L  - 36t t t d d d L  + 72t t t d d d L  -
         0 1 0 1 2        0 2 0 1 2        0 1 2 0 1 2         0 1 2 0 1 2        0 1 2 0 1 2        0 1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
          4 2   2   2      3   2   2   2       2 2 2   2   2        3 2   2   2      4 2   2   2       3 3   2   2  
      132t t d d d L  + 60t t t d d d L  - 396t t t d d d L  - 36t t t d d d L  - 36t t d d d L  + 180t t d d d L  +
          0 2 0 1 2        0 1 2 0 1 2         0 1 2 0 1 2        0 1 2 0 1 2        1 2 0 1 2         0 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
         2   3   2   2         2 3   2   2      3 3   2   2       2 4   2   2          4   2   2      2 4   2   2  
      60t t t d d d L  + 264t t t d d d L  + 36t t d d d L  - 132t t d d d L  - 72t t t d d d L  - 66t t d d d L  +
         0 1 2 0 1 2         0 1 2 0 1 2        1 2 0 1 2         0 2 0 1 2        0 1 2 0 1 2        1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
           5   2   2        5   2   2      5   3   2      4 2 3   2      5   3   2      4     3   2       3 2   3   2  
      42t t d d d L  + 12t t d d d L  + 12t t d d L  - 30t t d d L  + 24t t d d L  - 54t t t d d L  + 120t t t d d L  -
         0 2 0 1 2        1 2 0 1 2        0 1 1 2        0 1 1 2        0 2 1 2        0 1 2 1 2         0 1 2 1 2    
      ------------------------------------------------------------------------------------------------------------------
         4 2 3   2      3   2 3   2       2 2 2 3   2       3 3 3   2      2   3 3   2         2 3 3   2      2 4 3   2
      96t t d d L  + 96t t t d d L  - 180t t t d d L  + 144t t d d L  - 84t t t d d L  + 120t t t d d L  - 96t t d d L 
         0 2 1 2        0 1 2 1 2         0 1 2 1 2         0 2 1 2        0 1 2 1 2         0 1 2 1 2        0 2 1 2  
      ------------------------------------------------------------------------------------------------------------------
               4 3   2      2 4 3   2        5 3   2       5 3   2      4 2 2 2 2      3 3 2 2 2      2 4 2 2 2  
      + 36t t t d d L  - 30t t d d L  + 24t t d d L  - 6t t d d L  - 18t t d d L  + 64t t d d L  - 66t t d d L  +
           0 1 2 1 2        1 2 1 2        0 2 1 2       1 2 1 2        0 1 0 2        0 1 0 2        0 1 0 2    
      ------------------------------------------------------------------------------------------------------------------
           5 2 2 2     6 2 2 2      4     2 2 2       3 2   2 2 2       2 3   2 2 2         4   2 2 2      5   2 2 2  
      12t t d d L  + 8t d d L  + 36t t t d d L  - 156t t t d d L  + 216t t t d d L  - 108t t t d d L  + 12t t d d L  -
         0 1 0 2       1 0 2        0 1 2 0 2         0 1 2 0 2         0 1 2 0 2         0 1 2 0 2        1 2 0 2    
      ------------------------------------------------------------------------------------------------------------------
         4 2 2 2 2       3   2 2 2 2       2 2 2 2 2 2         3 2 2 2 2      4 2 2 2 2      3 3 2 2 2       2   3 2 2 2
      18t t d d L  + 120t t t d d L  - 252t t t d d L  + 216t t t d d L  - 66t t d d L  - 28t t d d L  + 120t t t d d L 
         0 2 0 2         0 1 2 0 2         0 1 2 0 2         0 1 2 0 2        1 2 0 2        0 2 0 2         0 1 2 0 2  
      ------------------------------------------------------------------------------------------------------------------
              2 3 2 2 2      3 3 2 2 2      2 4 2 2 2          4 2 2 2      2 4 2 2 2      5       2 2       4 2     2 2
      - 156t t t d d L  + 64t t d d L  - 18t t d d L  + 36t t t d d L  - 18t t d d L  + 42t t d d d L  - 132t t d d d L 
            0 1 2 0 2        1 2 0 2        0 2 0 2        0 1 2 0 2        1 2 0 2        0 1 0 1 2         0 1 0 1 2  
      ------------------------------------------------------------------------------------------------------------------
            3 3     2 2       2 4     2 2        5     2 2      5       2 2      4         2 2      3 2       2 2  
      + 180t t d d d L  - 132t t d d d L  + 42t t d d d L  + 12t t d d d L  - 72t t t d d d L  + 60t t t d d d L  +
            0 1 0 1 2         0 1 0 1 2        0 1 0 1 2        0 2 0 1 2        0 1 2 0 1 2        0 1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
         2 3       2 2        4       2 2      5       2 2      4 2     2 2       3   2     2 2       2 2 2     2 2  
      60t t t d d d L  - 72t t t d d d L  + 12t t d d d L  - 66t t d d d L  + 264t t t d d d L  - 396t t t d d d L  +
         0 1 2 0 1 2        0 1 2 0 1 2        1 2 0 1 2        0 2 0 1 2         0 1 2 0 1 2         0 1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
            3 2     2 2      4 2     2 2      3 3     2 2      2   3     2 2        2 3     2 2      3 3     2 2  
      264t t t d d d L  - 66t t d d d L  + 36t t d d d L  - 36t t t d d d L  - 36t t t d d d L  + 36t t d d d L  -
          0 1 2 0 1 2        1 2 0 1 2        0 2 0 1 2        0 1 2 0 1 2        0 1 2 0 1 2        1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
         2 4     2 2          4     2 2      2 4     2 2     6 2 2 2      5   2 2 2      4 2 2 2 2      3 3 2 2 2  
      36t t d d d L  + 72t t t d d d L  - 36t t d d d L  + 8t d d L  + 12t t d d L  - 66t t d d L  + 64t t d d L  -
         0 2 0 1 2        0 1 2 0 1 2        1 2 0 1 2       0 1 2        0 1 1 2        0 1 1 2        0 1 1 2    
      ------------------------------------------------------------------------------------------------------------------
         2 4 2 2 2      5   2 2 2       4     2 2 2       3 2   2 2 2       2 3   2 2 2        4   2 2 2      4 2 2 2 2
      18t t d d L  + 12t t d d L  - 108t t t d d L  + 216t t t d d L  - 156t t t d d L  + 36t t t d d L  - 66t t d d L 
         0 1 1 2        0 2 1 2         0 1 2 1 2         0 1 2 1 2         0 1 2 1 2        0 1 2 1 2        0 2 1 2  
      ------------------------------------------------------------------------------------------------------------------
            3   2 2 2 2       2 2 2 2 2 2         3 2 2 2 2      4 2 2 2 2      3 3 2 2 2       2   3 2 2 2  
      + 216t t t d d L  - 252t t t d d L  + 120t t t d d L  - 18t t d d L  + 64t t d d L  - 156t t t d d L  +
            0 1 2 1 2         0 1 2 1 2         0 1 2 1 2        1 2 1 2        0 2 1 2         0 1 2 1 2    
      ------------------------------------------------------------------------------------------------------------------
            2 3 2 2 2      3 3 2 2 2      2 4 2 2 2          4 2 2 2      2 4 2 2 2      5     3 2      4 2   3 2  
      120t t t d d L  - 28t t d d L  - 18t t d d L  + 36t t t d d L  - 18t t d d L  + 24t t d d L  - 96t t d d L  +
          0 1 2 1 2        1 2 1 2        0 2 1 2        0 1 2 1 2        1 2 1 2        0 1 0 2        0 1 0 2    
      ------------------------------------------------------------------------------------------------------------------
          3 3   3 2      2 4   3 2        5   3 2     5     3 2      4       3 2      3 2     3 2      2 3     3 2  
      144t t d d L  - 96t t d d L  + 24t t d d L  - 6t t d d L  + 36t t t d d L  - 84t t t d d L  + 96t t t d d L  -
          0 1 0 2        0 1 0 2        0 1 0 2       0 2 0 2        0 1 2 0 2        0 1 2 0 2        0 1 2 0 2    
      ------------------------------------------------------------------------------------------------------------------
           4     3 2      5     3 2      4 2   3 2       3   2   3 2       2 2 2   3 2         3 2   3 2      4 2   3 2
      54t t t d d L  + 12t t d d L  - 30t t d d L  + 120t t t d d L  - 180t t t d d L  + 120t t t d d L  - 30t t d d L 
         0 1 2 0 2        1 2 0 2        0 2 0 2         0 1 2 0 2         0 1 2 0 2         0 1 2 0 2        1 2 0 2  
      ------------------------------------------------------------------------------------------------------------------
           5     3 2      4 2   3 2       3 3   3 2      2 4   3 2        5   3 2      5     3 2      4       3 2  
      + 24t t d d L  - 96t t d d L  + 144t t d d L  - 96t t d d L  + 24t t d d L  + 12t t d d L  - 54t t t d d L  +
           0 1 1 2        0 1 1 2         0 1 1 2        0 1 1 2        0 1 1 2        0 2 1 2        0 1 2 1 2    
      ------------------------------------------------------------------------------------------------------------------
         3 2     3 2      2 3     3 2        4     3 2     5     3 2      4 2   3 2       3   2   3 2       2 2 2   3 2
      96t t t d d L  - 84t t t d d L  + 36t t t d d L  - 6t t d d L  - 30t t d d L  + 120t t t d d L  - 180t t t d d L 
         0 1 2 1 2        0 1 2 1 2        0 1 2 1 2       1 2 1 2        0 2 1 2         0 1 2 1 2         0 1 2 1 2  
      ------------------------------------------------------------------------------------------------------------------
              3 2   3 2      4 2   3 2     6 4 2      5   4 2      4 2 4 2      3 3 4 2      2 4 4 2        5 4 2  
      + 120t t t d d L  - 30t t d d L  - 4t d L  + 24t t d L  - 60t t d L  + 80t t d L  - 60t t d L  + 24t t d L  -
            0 1 2 1 2        1 2 1 2       0 2        0 1 2        0 1 2        0 1 2        0 1 2        0 1 2    
      ------------------------------------------------------------------------------------------------------------------
        6 4 2       4 4   2       3   4   2       2 2 4   2         3 4   2       4 4   2       2 2 3 2 2        3 3 2 2
      4t d L  + 108t d d L  - 432t t d d L  + 648t t d d L  - 432t t d d L  + 108t d d L  + 297t t d d L  + 54t t d d L 
        1 2         1 0 1         1 2 0 1         1 2 0 1         1 2 0 1         2 0 1         0 1 0 1        0 1 0 1  
      ------------------------------------------------------------------------------------------------------------------
           4 3 2 2       2     3 2 2         2   3 2 2       3   3 2 2       2 2 3 2 2           2 3 2 2       2 2 3 2 2
      + 81t d d L  - 594t t t d d L  - 432t t t d d L  - 486t t d d L  + 297t t d d L  + 702t t t d d L  + 945t t d d L 
           1 0 1         0 1 2 0 1         0 1 2 0 1         1 2 0 1         0 2 0 1         0 1 2 0 1         1 2 0 1  
      ------------------------------------------------------------------------------------------------------------------
              3 3 2 2         3 3 2 2       4 3 2 2      4 2 3 2      3   2 3 2       2 2 2 3 2       3   2 3 2  
      - 324t t d d L  - 756t t d d L  + 216t d d L  + 81t d d L  + 54t t d d L  + 297t t d d L  - 486t t d d L  -
            0 2 0 1         1 2 0 1         2 0 1        0 0 1        0 1 0 1         0 1 0 1         0 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
          2     2 3 2         2   2 3 2       2 2 2 3 2           2 2 3 2       2 2 2 3 2         3 2 3 2  
      432t t t d d L  - 594t t t d d L  + 945t t d d L  + 702t t t d d L  + 297t t d d L  - 756t t d d L  -
          0 1 2 0 1         0 1 2 0 1         0 2 0 1         0 1 2 0 1         1 2 0 1         0 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
            3 2 3 2       4 2 3 2       4   4 2       3     4 2       2 2   4 2         3   4 2       4   4 2  
      324t t d d L  + 216t d d L  + 108t d d L  - 432t t d d L  + 648t t d d L  - 432t t d d L  + 108t d d L  +
          1 2 0 1         2 0 1         0 0 1         0 2 0 1         0 2 0 1         0 2 0 1         2 0 1    
      ------------------------------------------------------------------------------------------------------------------
          4 4   2       3   4   2       2 2 4   2         3 4   2       4 4   2       2 2 3     2         3 3     2  
      108t d d L  - 432t t d d L  + 648t t d d L  - 432t t d d L  + 108t d d L  + 594t t d d d L  - 270t t d d d L  +
          1 0 2         1 2 0 2         1 2 0 2         1 2 0 2         2 0 2         0 1 0 1 2         0 1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
          4 3     2        2     3     2         2   3     2        3   3     2       2 2 3     2           2 3     2  
      324t d d d L  - 1188t t t d d d L  + 270t t t d d d L  - 1350t t d d d L  + 594t t d d d L  + 270t t t d d d L  +
          1 0 1 2          0 1 2 0 1 2         0 1 2 0 1 2          1 2 0 1 2         0 2 0 1 2         0 1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
           2 2 3     2         3 3     2          3 3     2       4 3     2       4 2 2   2       3   2 2   2  
      2052t t d d d L  - 270t t d d d L  - 1350t t d d d L  + 324t d d d L  + 243t d d d L  - 378t t d d d L  +
           1 2 0 1 2         0 2 0 1 2          1 2 0 1 2         2 0 1 2         0 0 1 2         0 1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
           2 2 2 2   2         3 2 2   2       4 2 2   2       3   2 2   2       2     2 2   2         2   2 2   2  
      1350t t d d d L  - 378t t d d d L  + 243t d d d L  - 918t t d d d L  - 918t t t d d d L  - 918t t t d d d L  -
           0 1 0 1 2         0 1 0 1 2         1 0 1 2         0 2 0 1 2         0 1 2 0 1 2         0 1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
          3   2 2   2        2 2 2 2   2           2 2 2   2        2 2 2 2   2          3 2 2   2          3 2 2   2  
      918t t d d d L  + 1998t t d d d L  + 540t t t d d d L  + 1998t t d d d L  - 1188t t d d d L  - 1188t t d d d L  +
          1 2 0 1 2          0 2 0 1 2         0 1 2 0 1 2          1 2 0 1 2          0 2 0 1 2          1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
          4 2 2   2       4   3   2       3     3   2       2 2   3   2        3     3   2       2       3   2  
      432t d d d L  + 324t d d d L  - 270t t d d d L  + 594t t d d d L  - 1350t t d d d L  + 270t t t d d d L  -
          2 0 1 2         0 0 1 2         0 1 0 1 2         0 1 0 1 2          0 2 0 1 2         0 1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
             2     3   2        2 2   3   2           2   3   2       2 2   3   2          3   3   2         3   3   2  
      1188t t t d d d L  + 2052t t d d d L  + 270t t t d d d L  + 594t t d d d L  - 1350t t d d d L  - 270t t d d d L  +
           0 1 2 0 1 2          0 2 0 1 2         0 1 2 0 1 2         1 2 0 1 2          0 2 0 1 2         1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
          4   3   2       4 4   2       3   4   2       2 2 4   2         3 4   2       4 4   2       2 2 3 2 2  
      324t d d d L  + 108t d d L  - 432t t d d L  + 648t t d d L  - 432t t d d L  + 108t d d L  + 297t t d d L  -
          2 0 1 2         0 1 2         0 2 1 2         0 2 1 2         0 2 1 2         2 1 2         0 1 0 2    
      ------------------------------------------------------------------------------------------------------------------
            3 3 2 2       4 3 2 2       2     3 2 2         2   3 2 2       3   3 2 2       2 2 3 2 2           2 3 2 2
      324t t d d L  + 216t d d L  - 594t t t d d L  + 702t t t d d L  - 756t t d d L  + 297t t d d L  - 432t t t d d L 
          0 1 0 2         1 0 2         0 1 2 0 2         0 1 2 0 2         1 2 0 2         0 2 0 2         0 1 2 0 2  
      ------------------------------------------------------------------------------------------------------------------
            2 2 3 2 2        3 3 2 2         3 3 2 2      4 3 2 2       4 2   2 2       3   2   2 2        2 2 2   2 2  
      + 945t t d d L  + 54t t d d L  - 486t t d d L  + 81t d d L  + 243t d d d L  - 918t t d d d L  + 1998t t d d d L  -
            1 2 0 2        0 2 0 2         1 2 0 2        2 0 2         0 0 1 2         0 1 0 1 2          0 1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
             3 2   2 2       4 2   2 2       3   2   2 2       2     2   2 2         2   2   2 2        3   2   2 2  
      1188t t d d d L  + 432t d d d L  - 378t t d d d L  - 918t t t d d d L  + 540t t t d d d L  - 1188t t d d d L  +
           0 1 0 1 2         1 0 1 2         0 2 0 1 2         0 1 2 0 1 2         0 1 2 0 1 2          1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
           2 2 2   2 2           2 2   2 2        2 2 2   2 2         3 2   2 2         3 2   2 2       4 2   2 2  
      1350t t d d d L  - 918t t t d d d L  + 1998t t d d d L  - 378t t d d d L  - 918t t d d d L  + 243t d d d L  +
           0 2 0 1 2         0 1 2 0 1 2          1 2 0 1 2         0 2 0 1 2         1 2 0 1 2         2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
          4   2 2 2        3     2 2 2        2 2   2 2 2         3   2 2 2       4   2 2 2        3     2 2 2  
      432t d d d L  - 1188t t d d d L  + 1998t t d d d L  - 918t t d d d L  + 243t d d d L  - 1188t t d d d L  +
          0 0 1 2          0 1 0 1 2          0 1 0 1 2         0 1 0 1 2         1 0 1 2          0 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
          2       2 2 2         2     2 2 2       3     2 2 2        2 2   2 2 2           2   2 2 2        2 2   2 2 2
      540t t t d d d L  - 918t t t d d d L  - 378t t d d d L  + 1998t t d d d L  - 918t t t d d d L  + 1350t t d d d L 
          0 1 2 0 1 2         0 1 2 0 1 2         1 2 0 1 2          0 2 0 1 2         0 1 2 0 1 2          1 2 0 1 2  
      ------------------------------------------------------------------------------------------------------------------
              3   2 2 2         3   2 2 2       4   2 2 2       4 3 2 2       3   3 2 2       2 2 3 2 2       3   3 2 2
      - 918t t d d d L  - 378t t d d d L  + 243t d d d L  + 216t d d L  - 324t t d d L  + 297t t d d L  - 756t t d d L 
            0 2 0 1 2         1 2 0 1 2         2 0 1 2         0 1 2         0 1 1 2         0 1 1 2         0 2 1 2  
      ------------------------------------------------------------------------------------------------------------------
            2     3 2 2         2   3 2 2       2 2 3 2 2           2 3 2 2       2 2 3 2 2         3 3 2 2  
      + 702t t t d d L  - 594t t t d d L  + 945t t d d L  - 432t t t d d L  + 297t t d d L  - 486t t d d L  +
            0 1 2 1 2         0 1 2 1 2         0 2 1 2         0 1 2 1 2         1 2 1 2         0 2 1 2    
      ------------------------------------------------------------------------------------------------------------------
           3 3 2 2      4 3 2 2      4 2 3 2       3   2 3 2       2 2 2 3 2         3 2 3 2       4 2 3 2  
      54t t d d L  + 81t d d L  + 81t d d L  - 486t t d d L  + 945t t d d L  - 756t t d d L  + 216t d d L  +
         1 2 1 2        2 1 2        0 0 2         0 1 0 2         0 1 0 2         0 1 0 2         1 0 2    
      ------------------------------------------------------------------------------------------------------------------
         3   2 3 2       2     2 3 2         2   2 3 2       3   2 3 2       2 2 2 3 2           2 2 3 2       2 2 2 3 2
      54t t d d L  - 432t t t d d L  + 702t t t d d L  - 324t t d d L  + 297t t d d L  - 594t t t d d L  + 297t t d d L 
         0 2 0 2         0 1 2 0 2         0 1 2 0 2         1 2 0 2         0 2 0 2         0 1 2 0 2         1 2 0 2  
      ------------------------------------------------------------------------------------------------------------------
            4     3 2        3       3 2        2 2     3 2          3     3 2       4     3 2       3       3 2  
      + 324t d d d L  - 1350t t d d d L  + 2052t t d d d L  - 1350t t d d d L  + 324t d d d L  - 270t t d d d L  +
            0 0 1 2          0 1 0 1 2          0 1 0 1 2          0 1 0 1 2         1 0 1 2         0 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
          2         3 2         2       3 2       3       3 2       2 2     3 2            2     3 2       2 2     3 2  
      270t t t d d d L  + 270t t t d d d L  - 270t t d d d L  + 594t t d d d L  - 1188t t t d d d L  + 594t t d d d L  +
          0 1 2 0 1 2         0 1 2 0 1 2         1 2 0 1 2         0 2 0 1 2          0 1 2 0 1 2         1 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
          4 2 3 2       3   2 3 2       2 2 2 3 2         3 2 3 2      4 2 3 2       3   2 3 2       2     2 3 2  
      216t d d L  - 756t t d d L  + 945t t d d L  - 486t t d d L  + 81t d d L  - 324t t d d L  + 702t t t d d L  -
          0 1 2         0 1 1 2         0 1 1 2         0 1 1 2        1 1 2         0 2 1 2         0 1 2 1 2    
      ------------------------------------------------------------------------------------------------------------------
            2   2 3 2      3   2 3 2       2 2 2 3 2           2 2 3 2       2 2 2 3 2       4   4 2       3     4 2  
      432t t t d d L  + 54t t d d L  + 297t t d d L  - 594t t t d d L  + 297t t d d L  + 108t d d L  - 432t t d d L  +
          0 1 2 1 2        1 2 1 2         0 2 1 2         0 1 2 1 2         1 2 1 2         0 0 2         0 1 0 2    
      ------------------------------------------------------------------------------------------------------------------
          2 2   4 2         3   4 2       4   4 2       4   4 2       3     4 2       2 2   4 2         3   4 2  
      648t t d d L  - 432t t d d L  + 108t d d L  + 108t d d L  - 432t t d d L  + 648t t d d L  - 432t t d d L  +
          0 1 0 2         0 1 0 2         1 0 2         0 1 2         0 1 1 2         0 1 1 2         0 1 1 2    
      ------------------------------------------------------------------------------------------------------------------
          4   4 2    4 4        3   4        2 2 4          3 4       4 4        2 2 3 2        3 3 2       2     3 2   
      108t d d L  - t d d L + 4t t d d L - 6t t d d L + 4t t d d L - t d d L - 5t t d d L - 2t t d d L + 10t t t d d L +
          1 1 2      1 0 1      1 2 0 1      1 2 0 1      1 2 0 1     2 0 1      0 1 0 1      0 1 0 1       0 1 2 0 1   
      ------------------------------------------------------------------------------------------------------------------
          2   3 2      3   3 2      2 2 3 2          2 3 2       2 2 3 2        3 3 2     4 3 2      3   2 3   
      4t t t d d L + 6t t d d L - 5t t d d L - 2t t t d d L - 11t t d d L + 4t t d d L + t d d L - 2t t d d L -
        0 1 2 0 1      1 2 0 1      0 2 0 1      0 1 2 0 1       1 2 0 1      1 2 0 1     2 0 1      0 1 0 1   
      ------------------------------------------------------------------------------------------------------------------
        2 2 2 3      3   2 3      2     2 3         2   2 3       2 2 2 3          2 2 3      2 2 2 3        3 2 3   
      5t t d d L + 6t t d d L + 4t t t d d L + 10t t t d d L - 11t t d d L - 2t t t d d L - 5t t d d L + 4t t d d L +
        0 1 0 1      0 2 0 1      0 1 2 0 1       0 1 2 0 1       0 2 0 1      0 1 2 0 1      1 2 0 1      0 2 0 1   
      ------------------------------------------------------------------------------------------------------------------
       4 2 3     4   4      3     4      2 2   4        3   4     4   4     4 4        3   4        2 2 4     
      t d d L - t d d L + 4t t d d L - 6t t d d L + 4t t d d L - t d d L - t d d L + 4t t d d L - 6t t d d L +
       2 0 1     0 0 1      0 2 0 1      0 2 0 1      0 2 0 1     2 0 1     1 0 2      1 2 0 2      1 2 0 2   
      ------------------------------------------------------------------------------------------------------------------
          3 4       4 4         2 2 3            3 3           2     3            2   3           3   3       
      4t t d d L - t d d L - 10t t d d d L - 2t t d d d L + 20t t t d d d L + 2t t t d d d L + 14t t d d d L -
        1 2 0 2     2 0 2       0 1 0 1 2      0 1 0 1 2       0 1 2 0 1 2      0 1 2 0 1 2       1 2 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
         2 2 3              2 3           2 2 3            3 3             3 3          3   2 2         2 2 2 2     
      10t t d d d L + 2t t t d d d L - 28t t d d d L - 2t t d d d L + 14t t d d d L + 2t t d d d L - 26t t d d d L +
         0 2 0 1 2      0 1 2 0 1 2       1 2 0 1 2      0 2 0 1 2       1 2 0 1 2      0 1 0 1 2       0 1 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
          3 2 2         3   2 2         2     2 2           2   2 2         3   2 2         2 2 2 2            2 2 2   
      2t t d d d L + 10t t d d d L + 22t t t d d d L + 22t t t d d d L + 10t t d d d L - 32t t d d d L + 4t t t d d d L
        0 1 0 1 2       0 2 0 1 2       0 1 2 0 1 2       0 1 2 0 1 2       1 2 0 1 2       0 2 0 1 2      0 1 2 0 1 2 
      ------------------------------------------------------------------------------------------------------------------
           2 2 2 2          3 2 2          3 2 2        4 2 2        3     3         2 2   3         3     3     
      - 32t t d d d L + 8t t d d d L + 8t t d d d L + 2t d d d L - 2t t d d d L - 10t t d d d L + 14t t d d d L +
           1 2 0 1 2      0 2 0 1 2      1 2 0 1 2      2 0 1 2      0 1 0 1 2       0 1 0 1 2       0 2 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
        2       3           2     3         2 2   3            2   3         2 2   3           3   3          3   3     
      2t t t d d d L + 20t t t d d d L - 28t t d d d L + 2t t t d d d L - 10t t d d d L + 14t t d d d L - 2t t d d d L -
        0 1 2 0 1 2       0 1 2 0 1 2       0 2 0 1 2      0 1 2 0 1 2       1 2 0 1 2       0 2 0 1 2      1 2 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
       4 4        3   4        2 2 4          3 4       4 4        2 2 3 2     4 3 2       2     3 2        2   3 2   
      t d d L + 4t t d d L - 6t t d d L + 4t t d d L - t d d L - 5t t d d L + t d d L + 10t t t d d L - 2t t t d d L +
       0 1 2      0 2 1 2      0 2 1 2      0 2 1 2     2 1 2      0 1 0 2     1 0 2       0 1 2 0 2      0 1 2 0 2   
      ------------------------------------------------------------------------------------------------------------------
        3   3 2      2 2 3 2          2 3 2       2 2 3 2        3 3 2        3 3 2       3   2   2       2 2 2   2   
      4t t d d L - 5t t d d L + 4t t t d d L - 11t t d d L - 2t t d d L + 6t t d d L + 10t t d d d L - 32t t d d d L +
        1 2 0 2      0 2 0 2      0 1 2 0 2       1 2 0 2      0 2 0 2      1 2 0 2       0 1 0 1 2       0 1 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
          3 2   2      4 2   2      3   2   2       2     2   2        2   2   2      3   2   2       2 2 2   2   
      8t t d d d L + 2t d d d L + 2t t d d d L + 22t t t d d d L + 4t t t d d d L + 8t t d d d L - 26t t d d d L +
        0 1 0 1 2      1 0 1 2      0 2 0 1 2       0 1 2 0 1 2      0 1 2 0 1 2      1 2 0 1 2       0 2 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
             2 2   2       2 2 2   2        3 2   2         3 2   2      4   2 2      3     2 2       2 2   2 2   
      22t t t d d d L - 32t t d d d L + 2t t d d d L + 10t t d d d L + 2t d d d L + 8t t d d d L - 32t t d d d L +
         0 1 2 0 1 2       1 2 0 1 2      0 2 0 1 2       1 2 0 1 2      0 0 1 2      0 1 0 1 2       0 1 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
           3   2 2      3     2 2      2       2 2         2     2 2      3     2 2       2 2   2 2           2   2 2   
      10t t d d d L + 8t t d d d L + 4t t t d d d L + 22t t t d d d L + 2t t d d d L - 32t t d d d L + 22t t t d d d L -
         0 1 0 1 2      0 2 0 1 2      0 1 2 0 1 2       0 1 2 0 1 2      1 2 0 1 2       0 2 0 1 2       0 1 2 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
         2 2   2 2         3   2 2        3   2 2     4 3 2      2 2 3 2      3   3 2      2     3 2         2   3 2   
      26t t d d d L + 10t t d d d L + 2t t d d d L + t d d L - 5t t d d L + 4t t d d L - 2t t t d d L + 10t t t d d L -
         1 2 0 1 2       0 2 0 1 2      1 2 0 1 2     0 1 2      0 1 1 2      0 2 1 2      0 1 2 1 2       0 1 2 1 2   
      ------------------------------------------------------------------------------------------------------------------
         2 2 3 2          2 3 2      2 2 3 2        3 3 2        3 3 2      3   2 3       2 2 2 3        3 2 3   
      11t t d d L + 4t t t d d L - 5t t d d L + 6t t d d L - 2t t d d L + 6t t d d L - 11t t d d L + 4t t d d L +
         0 2 1 2      0 1 2 1 2      1 2 1 2      0 2 1 2      1 2 1 2      0 1 0 2       0 1 0 2      0 1 0 2   
      ------------------------------------------------------------------------------------------------------------------
       4 2 3      3   2 3      2     2 3        2   2 3      2 2 2 3           2 2 3      2 2 2 3       3       3   
      t d d L - 2t t d d L + 4t t t d d L - 2t t t d d L - 5t t d d L + 10t t t d d L - 5t t d d L + 14t t d d d L -
       1 0 2      0 2 0 2      0 1 2 0 2      0 1 2 0 2      0 2 0 2       0 1 2 0 2      1 2 0 2       0 1 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
         2 2     3         3     3      3       3      2         3        2       3      3       3       2 2     3   
      28t t d d d L + 14t t d d d L - 2t t d d d L + 2t t t d d d L + 2t t t d d d L - 2t t d d d L - 10t t d d d L +
         0 1 0 1 2       0 1 0 1 2      0 2 0 1 2      0 1 2 0 1 2      0 1 2 0 1 2      1 2 0 1 2       0 2 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
             2     3       2 2     3     4 2 3      3   2 3       2 2 2 3        3 2 3      2     2 3        2   2 3   
      20t t t d d d L - 10t t d d d L + t d d L + 4t t d d L - 11t t d d L + 6t t d d L - 2t t t d d L + 4t t t d d L -
         0 1 2 0 1 2       1 2 0 1 2     0 1 2      0 1 1 2       0 1 1 2      0 1 1 2      0 1 2 1 2      0 1 2 1 2   
      ------------------------------------------------------------------------------------------------------------------
        3   2 3      2 2 2 3           2 2 3      2 2 2 3     4   4      3     4      2 2   4        3   4     4   4   
      2t t d d L - 5t t d d L + 10t t t d d L - 5t t d d L - t d d L + 4t t d d L - 6t t d d L + 4t t d d L - t d d L -
        1 2 1 2      0 2 1 2       0 1 2 1 2      1 2 1 2     0 0 2      0 1 0 2      0 1 0 2      0 1 0 2     1 0 2   
      ------------------------------------------------------------------------------------------------------------------
       4   4      3     4      2 2   4        3   4     4   4        2 4 2 2            4 2 2       2 4 2 2  
      t d d L + 4t t d d L - 6t t d d L + 4t t d d L - t d d L - 972t d d L  + 1944t t d d L  - 972t d d L  -
       0 1 2      0 1 1 2      0 1 1 2      0 1 1 2     1 1 2        1 0 1          1 2 0 1         2 0 1    
      ------------------------------------------------------------------------------------------------------------------
          2 3 3 2       2 3 3 2            3 3 2            3 3 2        2 3 3 2       2 2 4 2            2 4 2  
      972t d d L  - 972t d d L  + 1944t t d d L  + 1944t t d d L  - 1944t d d L  - 972t d d L  + 1944t t d d L  -
          0 0 1         1 0 1          0 2 0 1          1 2 0 1          2 0 1         0 0 1          0 2 0 1    
      ------------------------------------------------------------------------------------------------------------------
          2 2 4 2        2 4     2            4     2        2 4     2        2 3 2   2            3 2   2  
      972t d d L  - 1944t d d d L  + 3888t t d d d L  - 1944t d d d L  - 2916t d d d L  + 1944t t d d d L  -
          2 0 1          1 0 1 2          1 2 0 1 2          2 0 1 2          0 0 1 2          0 1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
           2 3 2   2            3 2   2            3 2   2        2 3 2   2        2 2 3   2            2 3   2  
      4860t d d d L  + 3888t t d d d L  + 7776t t d d d L  - 5832t d d d L  - 4860t d d d L  + 1944t t d d d L  -
           1 0 1 2          0 2 0 1 2          1 2 0 1 2          2 0 1 2          0 0 1 2          0 1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
           2 2 3   2            2 3   2            2 3   2        2 2 3   2        2   4   2              4   2  
      2916t d d d L  + 7776t t d d d L  + 3888t t d d d L  - 5832t d d d L  - 1944t d d d L  + 3888t t d d d L  -
           1 0 1 2          0 2 0 1 2          1 2 0 1 2          2 0 1 2          0 0 1 2          0 2 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
           2   4   2       2 4 2 2            4 2 2       2 4 2 2        2 3   2 2            3   2 2        2 3   2 2  
      1944t d d d L  - 972t d d L  + 1944t t d d L  - 972t d d L  - 2916t d d d L  + 3888t t d d d L  - 5832t d d d L  +
           2 0 1 2         1 0 2          1 2 0 2         2 0 2          0 0 1 2          0 1 0 1 2          1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
               3   2 2            3   2 2        2 3   2 2        2 2 2 2 2            2 2 2 2        2 2 2 2 2  
      1944t t d d d L  + 7776t t d d d L  - 4860t d d d L  - 7776t d d d L  + 7776t t d d d L  - 7776t d d d L  +
           0 2 0 1 2          1 2 0 1 2          2 0 1 2          0 0 1 2          0 1 0 1 2          1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
               2 2 2 2            2 2 2 2        2 2 2 2 2        2   3 2 2              3 2 2        2   3 2 2  
      7776t t d d d L  + 7776t t d d d L  - 7776t d d d L  - 5832t d d d L  + 3888t t d d d L  - 2916t d d d L  +
           0 2 0 1 2          1 2 0 1 2          2 0 1 2          0 0 1 2          0 1 0 1 2          1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
                 3 2 2              3 2 2        2   3 2 2       2 4 2 2            4 2 2       2 4 2 2       2 3 3 2  
      7776t t d d d L  + 1944t t d d d L  - 4860t d d d L  - 972t d d L  + 1944t t d d L  - 972t d d L  - 972t d d L  +
           0 2 0 1 2          1 2 0 1 2          2 0 1 2         0 1 2          0 2 1 2         2 1 2         0 0 2    
      ------------------------------------------------------------------------------------------------------------------
               3 3 2        2 3 3 2            3 3 2       2 3 3 2        2 2   3 2            2   3 2        2 2   3 2
      1944t t d d L  - 1944t d d L  + 1944t t d d L  - 972t d d L  - 4860t d d d L  + 7776t t d d d L  - 5832t d d d L 
           0 1 0 2          1 0 2          1 2 0 2         2 0 2          0 0 1 2          0 1 0 1 2          1 0 1 2  
      ------------------------------------------------------------------------------------------------------------------
                 2   3 2            2   3 2        2 2   3 2        2   2 3 2              2 3 2        2   2 3 2  
      + 1944t t d d d L  + 3888t t d d d L  - 2916t d d d L  - 5832t d d d L  + 7776t t d d d L  - 4860t d d d L  +
             0 2 0 1 2          1 2 0 1 2          2 0 1 2          0 0 1 2          0 1 0 1 2          1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
                 2 3 2              2 3 2        2   2 3 2        2 3 3 2            3 3 2       2 3 3 2  
      3888t t d d d L  + 1944t t d d d L  - 2916t d d d L  - 1944t d d L  + 1944t t d d L  - 972t d d L  +
           0 2 0 1 2          1 2 0 1 2          2 0 1 2          0 1 2          0 1 1 2         1 1 2    
      ------------------------------------------------------------------------------------------------------------------
               3 3 2       2 3 3 2       2 2 4 2            2 4 2       2 2 4 2        2     4 2                4 2  
      1944t t d d L  - 972t d d L  - 972t d d L  + 1944t t d d L  - 972t d d L  - 1944t d d d L  + 3888t t d d d L  -
           0 2 1 2         2 1 2         0 0 2          0 1 0 2         1 0 2          0 0 1 2          0 1 0 1 2    
      ------------------------------------------------------------------------------------------------------------------
           2     4 2       2 2 4 2            2 4 2       2 2 4 2      2 4 2           4 2       2 4 2       2 3 3   
      1944t d d d L  - 972t d d L  + 1944t t d d L  - 972t d d L  + 36t d d L - 72t t d d L + 36t d d L + 36t d d L +
           1 0 1 2         0 1 2          0 1 1 2         1 1 2        1 0 1       1 2 0 1       2 0 1       0 0 1   
      ------------------------------------------------------------------------------------------------------------------
         2 3 3           3 3           3 3       2 3 3       2 2 4           2 4       2 2 4       2 4       
      36t d d L - 72t t d d L - 72t t d d L + 72t d d L + 36t d d L - 72t t d d L + 36t d d L + 72t d d d L -
         1 0 1       0 2 0 1       1 2 0 1       2 0 1       0 0 1       0 2 0 1       2 0 1       1 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
              4           2 4            2 3 2             3 2          2 3 2              3 2              3 2     
      144t t d d d L + 72t d d d L + 108t d d d L - 72t t d d d L + 180t d d d L - 144t t d d d L - 288t t d d d L +
          1 2 0 1 2       2 0 1 2        0 0 1 2       0 1 0 1 2        1 0 1 2        0 2 0 1 2        1 2 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
          2 3 2          2 2 3             2 3          2 2 3              2 3              2 3          2 2 3     
      216t d d d L + 180t d d d L - 72t t d d d L + 108t d d d L - 288t t d d d L - 144t t d d d L + 216t d d d L +
          2 0 1 2        0 0 1 2       0 1 0 1 2        1 0 1 2        0 2 0 1 2        1 2 0 1 2        2 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
         2   4                4         2   4         2 4 2           4 2       2 4 2        2 3   2            3   2   
      72t d d d L - 144t t d d d L + 72t d d d L + 36t d d L - 72t t d d L + 36t d d L + 108t d d d L - 144t t d d d L +
         0 0 1 2        0 2 0 1 2       2 0 1 2       1 0 2       1 2 0 2       2 0 2        0 0 1 2        0 1 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
          2 3   2           3   2            3   2        2 3   2        2 2 2 2            2 2 2        2 2 2 2   
      216t d d d L - 72t t d d d L - 288t t d d d L + 180t d d d L + 288t d d d L - 288t t d d d L + 288t d d d L -
          1 0 1 2       0 2 0 1 2        1 2 0 1 2        2 0 1 2        0 0 1 2        0 1 0 1 2        1 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
              2 2 2            2 2 2        2 2 2 2        2   3 2              3 2        2   3 2              3 2   
      288t t d d d L - 288t t d d d L + 288t d d d L + 216t d d d L - 144t t d d d L + 108t d d d L - 288t t d d d L -
          0 2 0 1 2        1 2 0 1 2        2 0 1 2        0 0 1 2        0 1 0 1 2        1 0 1 2        0 2 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
               3 2        2   3 2       2 4 2           4 2       2 4 2       2 3 3           3 3       2 3 3   
      72t t d d d L + 180t d d d L + 36t d d L - 72t t d d L + 36t d d L + 36t d d L - 72t t d d L + 72t d d L -
         1 2 0 1 2        2 0 1 2       0 1 2       0 2 1 2       2 1 2       0 0 2       0 1 0 2       1 0 2   
      ------------------------------------------------------------------------------------------------------------------
             3 3       2 3 3        2 2   3            2   3        2 2   3           2   3            2   3   
      72t t d d L + 36t d d L + 180t d d d L - 288t t d d d L + 216t d d d L - 72t t d d d L - 144t t d d d L +
         1 2 0 2       2 0 2        0 0 1 2        0 1 0 1 2        1 0 1 2       0 2 0 1 2        1 2 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
          2 2   3        2   2 3              2 3        2   2 3              2 3             2 3        2   2 3   
      108t d d d L + 216t d d d L - 288t t d d d L + 180t d d d L - 144t t d d d L - 72t t d d d L + 108t d d d L +
          2 0 1 2        0 0 1 2        0 1 0 1 2        1 0 1 2        0 2 0 1 2       1 2 0 1 2        2 0 1 2   
      ------------------------------------------------------------------------------------------------------------------
         2 3 3           3 3       2 3 3           3 3       2 3 3       2 2 4           2 4       2 2 4       2     4 
      72t d d L - 72t t d d L + 36t d d L - 72t t d d L + 36t d d L + 36t d d L - 72t t d d L + 36t d d L + 72t d d d L
         0 1 2       0 1 1 2       1 1 2       0 2 1 2       2 1 2       0 0 2       0 1 0 2       1 0 2       0 0 1 2 
      ------------------------------------------------------------------------------------------------------------------
                    4       2     4       2 2 4           2 4       2 2 4         4 3 2        3 4 2        4 2   2  
      - 144t t d d d L + 72t d d d L + 36t d d L - 72t t d d L + 36t d d L + 2916d d L  + 2916d d L  + 8748d d d L  +
            0 1 0 1 2       1 0 1 2       0 1 2       0 1 1 2       1 1 2         0 1          0 1          0 1 2    
      ------------------------------------------------------------------------------------------------------------------
            3 3   2        2 4   2        4   2 2         3 2 2 2         2 3 2 2          4 2 2        4 3 2  
      17496d d d L  + 8748d d d L  + 8748d d d L  + 29160d d d L  + 29160d d d L  + 8748d d d L  + 2916d d L  +
            0 1 2          0 1 2          0 1 2           0 1 2           0 1 2          0 1 2          0 2    
      ------------------------------------------------------------------------------------------------------------------
            3   3 2         2 2 3 2           3 3 2        4 3 2        3 4 2        2   4 2          2 4 2        3 4 2
      17496d d d L  + 29160d d d L  + 17496d d d L  + 2916d d L  + 2916d d L  + 8748d d d L  + 8748d d d L  + 2916d d L 
            0 1 2           0 1 2           0 1 2          1 2          0 2          0 1 2          0 1 2          1 2  
      ------------------------------------------------------------------------------------------------------------------
            4 3        3 4        4 2           3 3          2 4          4   2         3 2 2         2 3 2   
      - 216d d L - 216d d L - 648d d d L - 1296d d d L - 648d d d L - 648d d d L - 2160d d d L - 2160d d d L -
            0 1        0 1        0 1 2         0 1 2        0 1 2        0 1 2         0 1 2         0 1 2   
      ------------------------------------------------------------------------------------------------------------------
            4 2        4 3         3   3         2 2 3           3 3        4 3        3 4        2   4          2 4   
      648d d d L - 216d d L - 1296d d d L - 2160d d d L - 1296d d d L - 216d d L - 216d d L - 648d d d L - 648d d d L -
          0 1 2        0 2         0 1 2         0 1 2         0 1 2        1 2        0 2        0 1 2        0 1 2   
      ------------------------------------------------------------------------------------------------------------------
          3 4      4 3     3 4      4 2        3 3        2 4        4   2      3 2 2      2 3 2        4 2     4 3  
      216d d L + 4d d  + 4d d  + 12d d d  + 24d d d  + 12d d d  + 12d d d  + 40d d d  + 40d d d  + 12d d d  + 4d d  +
          1 2      0 1     0 1      0 1 2      0 1 2      0 1 2      0 1 2      0 1 2      0 1 2      0 1 2     0 2  
      ------------------------------------------------------------------------------------------------------------------
         3   3      2 2 3        3 3     4 3     3 4      2   4        2 4     3 4
      24d d d  + 40d d d  + 24d d d  + 4d d  + 4d d  + 12d d d  + 12d d d  + 4d d
         0 1 2      0 1 2      0 1 2     1 2     0 2      0 1 2      0 1 2     1 2

o24 : S

i25 : -- Properties of H
      isPrime H

   -- registering gb 1 at 0xb513130

   -- [gb]{13}(1)mnumber of (nonminimal) gb elements = 1
   -- number of monomials                = 996
   -- #reduction steps = 0
   -- #spairs done = 1
   -- ncalls = 0
   -- nloop = 0
   -- nsaved = 0
   -- 
o25 = true

i26 : isHomogeneous H

o26 = true

i27 : size H

o27 = 996

i28 : -- Work with a sub-family (eg. Hamiltonian vector fields)
      subVals = {t_0 => 0, t_1 => 0, t_2 => 0};

i29 : HVals = sub(H, subVals);

i30 : factor HVals  -- hidden relation for the Hamiltonian family

               2                                               2
o30 = (27L - 1) (d  + d )(d  + d )(d  + d )(d d  + d d  + d d ) (4)
                  1    2   0    2   0    1   0 1    0 2    1 2

o30 : Expression of class Product

i31 : -- Irreducibility of B and C
      isPrime A  --false

   -- registering gb 2 at 0xb513000

   -- [gb]{1}(1)mnumber of (nonminimal) gb elements = 1
   -- number of monomials                = 2
   -- #reduction steps = 0
   -- #spairs done = 1
   -- ncalls = 0
   -- nloop = 0
   -- nsaved = 0
   -- 
   -- registering gb 3 at 0xb038d10

   -- [gb]{1}(1)mnumber of (nonminimal) gb elements = 1
   -- number of monomials                = 2
   -- #reduction steps = 0
   -- #spairs done = 1
   -- ncalls = 0
   -- nloop = 0
   -- nsaved = 0
   -- 
   -- registering gb 4 at 0xb038be0

   -- [gb]{1}(1)mnumber of (nonminimal) gb elements = 1
   -- number of monomials                = 2
   -- #reduction steps = 0
   -- #spairs done = 1
   -- ncalls = 0
   -- nloop = 0
   -- nsaved = 0
   -- 
   -- registering gb 5 at 0xb038ab0

   -- [gb]{0}(1)mnumber of (nonminimal) gb elements = 1
   -- number of monomials                = 1
   -- #reduction steps = 0
   -- #spairs done = 1
   -- ncalls = 0
   -- nloop = 0
   -- nsaved = 0
   -- 
o31 = false

i32 : factor A

o32 = (d  + d )(d  + d )(d  + d )(4)
        1    2   0    2   0    1

o32 : Expression of class Product

i33 : isPrime B  --true

   -- registering gb 6 at 0xb038980

   -- [gb]{7}(1)mnumber of (nonminimal) gb elements = 1
   -- number of monomials                = 150
   -- #reduction steps = 0
   -- #spairs done = 1
   -- ncalls = 0
   -- nloop = 0
   -- nsaved = 0
   -- 
o33 = true

i34 : isPrime C  --true

   -- registering gb 7 at 0xb038720

   -- [gb]{11}(1)mnumber of (nonminimal) gb elements = 1
   -- number of monomials                = 717
   -- #reduction steps = 0
   -- #spairs done = 1
   -- ncalls = 0
   -- nloop = 0
   -- nsaved = 0
   -- 
o34 = true

i35 : --------------------
      -- Export the H_i --
      --------------------
      toString H0

o35 = 4*d_0^4*d_1^3+4*d_0^3*d_1^4+12*d_0^4*d_1^2*d_2+24*d_0^3*d_1^3*d_2+12*d_0^2*d_1^4*d_2+12*d_0^4*d_1*d_2^2+40*d_0^3*d
      _1^2*d_2^2+40*d_0^2*d_1^3*d_2^2+12*d_0*d_1^4*d_2^2+4*d_0^4*d_2^3+24*d_0^3*d_1*d_2^3+40*d_0^2*d_1^2*d_2^3+24*d_0*d_
      1^3*d_2^3+4*d_1^4*d_2^3+4*d_0^3*d_2^4+12*d_0^2*d_1*d_2^4+12*d_0*d_1^2*d_2^4+4*d_1^3*d_2^4

i36 : toString H1

o36 = -t_1^4*d_0^4*d_1+4*t_1^3*t_2*d_0^4*d_1-6*t_1^2*t_2^2*d_0^4*d_1+4*t_1*t_2^3*d_0^4*d_1-t_2^4*d_0^4*d_1-5*t_0^2*t_1^2
      *d_0^3*d_1^2-2*t_0*t_1^3*d_0^3*d_1^2+10*t_0^2*t_1*t_2*d_0^3*d_1^2+4*t_0*t_1^2*t_2*d_0^3*d_1^2+6*t_1^3*t_2*d_0^3*d_
      1^2-5*t_0^2*t_2^2*d_0^3*d_1^2-2*t_0*t_1*t_2^2*d_0^3*d_1^2-11*t_1^2*t_2^2*d_0^3*d_1^2+4*t_1*t_2^3*d_0^3*d_1^2+t_2^4
      *d_0^3*d_1^2-2*t_0^3*t_1*d_0^2*d_1^3-5*t_0^2*t_1^2*d_0^2*d_1^3+6*t_0^3*t_2*d_0^2*d_1^3+4*t_0^2*t_1*t_2*d_0^2*d_1^3
      +10*t_0*t_1^2*t_2*d_0^2*d_1^3-11*t_0^2*t_2^2*d_0^2*d_1^3-2*t_0*t_1*t_2^2*d_0^2*d_1^3-5*t_1^2*t_2^2*d_0^2*d_1^3+4*t
      _0*t_2^3*d_0^2*d_1^3+t_2^4*d_0^2*d_1^3-t_0^4*d_0*d_1^4+4*t_0^3*t_2*d_0*d_1^4-6*t_0^2*t_2^2*d_0*d_1^4+4*t_0*t_2^3*d
      _0*d_1^4-t_2^4*d_0*d_1^4-t_1^4*d_0^4*d_2+4*t_1^3*t_2*d_0^4*d_2-6*t_1^2*t_2^2*d_0^4*d_2+4*t_1*t_2^3*d_0^4*d_2-t_2^4
      *d_0^4*d_2-10*t_0^2*t_1^2*d_0^3*d_1*d_2-2*t_0*t_1^3*d_0^3*d_1*d_2+20*t_0^2*t_1*t_2*d_0^3*d_1*d_2+2*t_0*t_1^2*t_2*d
      _0^3*d_1*d_2+14*t_1^3*t_2*d_0^3*d_1*d_2-10*t_0^2*t_2^2*d_0^3*d_1*d_2+2*t_0*t_1*t_2^2*d_0^3*d_1*d_2-28*t_1^2*t_2^2*
      d_0^3*d_1*d_2-2*t_0*t_2^3*d_0^3*d_1*d_2+14*t_1*t_2^3*d_0^3*d_1*d_2+2*t_0^3*t_1*d_0^2*d_1^2*d_2-26*t_0^2*t_1^2*d_0^
      2*d_1^2*d_2+2*t_0*t_1^3*d_0^2*d_1^2*d_2+10*t_0^3*t_2*d_0^2*d_1^2*d_2+22*t_0^2*t_1*t_2*d_0^2*d_1^2*d_2+22*t_0*t_1^2
      *t_2*d_0^2*d_1^2*d_2+10*t_1^3*t_2*d_0^2*d_1^2*d_2-32*t_0^2*t_2^2*d_0^2*d_1^2*d_2+4*t_0*t_1*t_2^2*d_0^2*d_1^2*d_2-
      32*t_1^2*t_2^2*d_0^2*d_1^2*d_2+8*t_0*t_2^3*d_0^2*d_1^2*d_2+8*t_1*t_2^3*d_0^2*d_1^2*d_2+2*t_2^4*d_0^2*d_1^2*d_2-2*t
      _0^3*t_1*d_0*d_1^3*d_2-10*t_0^2*t_1^2*d_0*d_1^3*d_2+14*t_0^3*t_2*d_0*d_1^3*d_2+2*t_0^2*t_1*t_2*d_0*d_1^3*d_2+20*t_
      0*t_1^2*t_2*d_0*d_1^3*d_2-28*t_0^2*t_2^2*d_0*d_1^3*d_2+2*t_0*t_1*t_2^2*d_0*d_1^3*d_2-10*t_1^2*t_2^2*d_0*d_1^3*d_2+
      14*t_0*t_2^3*d_0*d_1^3*d_2-2*t_1*t_2^3*d_0*d_1^3*d_2-t_0^4*d_1^4*d_2+4*t_0^3*t_2*d_1^4*d_2-6*t_0^2*t_2^2*d_1^4*d_2
      +4*t_0*t_2^3*d_1^4*d_2-t_2^4*d_1^4*d_2-5*t_0^2*t_1^2*d_0^3*d_2^2+t_1^4*d_0^3*d_2^2+10*t_0^2*t_1*t_2*d_0^3*d_2^2-2*
      t_0*t_1^2*t_2*d_0^3*d_2^2+4*t_1^3*t_2*d_0^3*d_2^2-5*t_0^2*t_2^2*d_0^3*d_2^2+4*t_0*t_1*t_2^2*d_0^3*d_2^2-11*t_1^2*t
      _2^2*d_0^3*d_2^2-2*t_0*t_2^3*d_0^3*d_2^2+6*t_1*t_2^3*d_0^3*d_2^2+10*t_0^3*t_1*d_0^2*d_1*d_2^2-32*t_0^2*t_1^2*d_0^2
      *d_1*d_2^2+8*t_0*t_1^3*d_0^2*d_1*d_2^2+2*t_1^4*d_0^2*d_1*d_2^2+2*t_0^3*t_2*d_0^2*d_1*d_2^2+22*t_0^2*t_1*t_2*d_0^2*
      d_1*d_2^2+4*t_0*t_1^2*t_2*d_0^2*d_1*d_2^2+8*t_1^3*t_2*d_0^2*d_1*d_2^2-26*t_0^2*t_2^2*d_0^2*d_1*d_2^2+22*t_0*t_1*t_
      2^2*d_0^2*d_1*d_2^2-32*t_1^2*t_2^2*d_0^2*d_1*d_2^2+2*t_0*t_2^3*d_0^2*d_1*d_2^2+10*t_1*t_2^3*d_0^2*d_1*d_2^2+2*t_0^
      4*d_0*d_1^2*d_2^2+8*t_0^3*t_1*d_0*d_1^2*d_2^2-32*t_0^2*t_1^2*d_0*d_1^2*d_2^2+10*t_0*t_1^3*d_0*d_1^2*d_2^2+8*t_0^3*
      t_2*d_0*d_1^2*d_2^2+4*t_0^2*t_1*t_2*d_0*d_1^2*d_2^2+22*t_0*t_1^2*t_2*d_0*d_1^2*d_2^2+2*t_1^3*t_2*d_0*d_1^2*d_2^2-
      32*t_0^2*t_2^2*d_0*d_1^2*d_2^2+22*t_0*t_1*t_2^2*d_0*d_1^2*d_2^2-26*t_1^2*t_2^2*d_0*d_1^2*d_2^2+10*t_0*t_2^3*d_0*d_
      1^2*d_2^2+2*t_1*t_2^3*d_0*d_1^2*d_2^2+t_0^4*d_1^3*d_2^2-5*t_0^2*t_1^2*d_1^3*d_2^2+4*t_0^3*t_2*d_1^3*d_2^2-2*t_0^2*
      t_1*t_2*d_1^3*d_2^2+10*t_0*t_1^2*t_2*d_1^3*d_2^2-11*t_0^2*t_2^2*d_1^3*d_2^2+4*t_0*t_1*t_2^2*d_1^3*d_2^2-5*t_1^2*t_
      2^2*d_1^3*d_2^2+6*t_0*t_2^3*d_1^3*d_2^2-2*t_1*t_2^3*d_1^3*d_2^2+6*t_0^3*t_1*d_0^2*d_2^3-11*t_0^2*t_1^2*d_0^2*d_2^3
      +4*t_0*t_1^3*d_0^2*d_2^3+t_1^4*d_0^2*d_2^3-2*t_0^3*t_2*d_0^2*d_2^3+4*t_0^2*t_1*t_2*d_0^2*d_2^3-2*t_0*t_1^2*t_2*d_0
      ^2*d_2^3-5*t_0^2*t_2^2*d_0^2*d_2^3+10*t_0*t_1*t_2^2*d_0^2*d_2^3-5*t_1^2*t_2^2*d_0^2*d_2^3+14*t_0^3*t_1*d_0*d_1*d_2
      ^3-28*t_0^2*t_1^2*d_0*d_1*d_2^3+14*t_0*t_1^3*d_0*d_1*d_2^3-2*t_0^3*t_2*d_0*d_1*d_2^3+2*t_0^2*t_1*t_2*d_0*d_1*d_2^3
      +2*t_0*t_1^2*t_2*d_0*d_1*d_2^3-2*t_1^3*t_2*d_0*d_1*d_2^3-10*t_0^2*t_2^2*d_0*d_1*d_2^3+20*t_0*t_1*t_2^2*d_0*d_1*d_2
      ^3-10*t_1^2*t_2^2*d_0*d_1*d_2^3+t_0^4*d_1^2*d_2^3+4*t_0^3*t_1*d_1^2*d_2^3-11*t_0^2*t_1^2*d_1^2*d_2^3+6*t_0*t_1^3*d
      _1^2*d_2^3-2*t_0^2*t_1*t_2*d_1^2*d_2^3+4*t_0*t_1^2*t_2*d_1^2*d_2^3-2*t_1^3*t_2*d_1^2*d_2^3-5*t_0^2*t_2^2*d_1^2*d_2
      ^3+10*t_0*t_1*t_2^2*d_1^2*d_2^3-5*t_1^2*t_2^2*d_1^2*d_2^3-t_0^4*d_0*d_2^4+4*t_0^3*t_1*d_0*d_2^4-6*t_0^2*t_1^2*d_0*
      d_2^4+4*t_0*t_1^3*d_0*d_2^4-t_1^4*d_0*d_2^4-t_0^4*d_1*d_2^4+4*t_0^3*t_1*d_1*d_2^4-6*t_0^2*t_1^2*d_1*d_2^4+4*t_0*t_
      1^3*d_1*d_2^4-t_1^4*d_1*d_2^4+36*t_1^2*d_0^4*d_1^2-72*t_1*t_2*d_0^4*d_1^2+36*t_2^2*d_0^4*d_1^2+36*t_0^2*d_0^3*d_1^
      3+36*t_1^2*d_0^3*d_1^3-72*t_0*t_2*d_0^3*d_1^3-72*t_1*t_2*d_0^3*d_1^3+72*t_2^2*d_0^3*d_1^3+36*t_0^2*d_0^2*d_1^4-72*
      t_0*t_2*d_0^2*d_1^4+36*t_2^2*d_0^2*d_1^4+72*t_1^2*d_0^4*d_1*d_2-144*t_1*t_2*d_0^4*d_1*d_2+72*t_2^2*d_0^4*d_1*d_2+
      108*t_0^2*d_0^3*d_1^2*d_2-72*t_0*t_1*d_0^3*d_1^2*d_2+180*t_1^2*d_0^3*d_1^2*d_2-144*t_0*t_2*d_0^3*d_1^2*d_2-288*t_1
      *t_2*d_0^3*d_1^2*d_2+216*t_2^2*d_0^3*d_1^2*d_2+180*t_0^2*d_0^2*d_1^3*d_2-72*t_0*t_1*d_0^2*d_1^3*d_2+108*t_1^2*d_0^
      2*d_1^3*d_2-288*t_0*t_2*d_0^2*d_1^3*d_2-144*t_1*t_2*d_0^2*d_1^3*d_2+216*t_2^2*d_0^2*d_1^3*d_2+72*t_0^2*d_0*d_1^4*d
      _2-144*t_0*t_2*d_0*d_1^4*d_2+72*t_2^2*d_0*d_1^4*d_2+36*t_1^2*d_0^4*d_2^2-72*t_1*t_2*d_0^4*d_2^2+36*t_2^2*d_0^4*d_2
      ^2+108*t_0^2*d_0^3*d_1*d_2^2-144*t_0*t_1*d_0^3*d_1*d_2^2+216*t_1^2*d_0^3*d_1*d_2^2-72*t_0*t_2*d_0^3*d_1*d_2^2-288*
      t_1*t_2*d_0^3*d_1*d_2^2+180*t_2^2*d_0^3*d_1*d_2^2+288*t_0^2*d_0^2*d_1^2*d_2^2-288*t_0*t_1*d_0^2*d_1^2*d_2^2+288*t_
      1^2*d_0^2*d_1^2*d_2^2-288*t_0*t_2*d_0^2*d_1^2*d_2^2-288*t_1*t_2*d_0^2*d_1^2*d_2^2+288*t_2^2*d_0^2*d_1^2*d_2^2+216*
      t_0^2*d_0*d_1^3*d_2^2-144*t_0*t_1*d_0*d_1^3*d_2^2+108*t_1^2*d_0*d_1^3*d_2^2-288*t_0*t_2*d_0*d_1^3*d_2^2-72*t_1*t_2
      *d_0*d_1^3*d_2^2+180*t_2^2*d_0*d_1^3*d_2^2+36*t_0^2*d_1^4*d_2^2-72*t_0*t_2*d_1^4*d_2^2+36*t_2^2*d_1^4*d_2^2+36*t_0
      ^2*d_0^3*d_2^3-72*t_0*t_1*d_0^3*d_2^3+72*t_1^2*d_0^3*d_2^3-72*t_1*t_2*d_0^3*d_2^3+36*t_2^2*d_0^3*d_2^3+180*t_0^2*d
      _0^2*d_1*d_2^3-288*t_0*t_1*d_0^2*d_1*d_2^3+216*t_1^2*d_0^2*d_1*d_2^3-72*t_0*t_2*d_0^2*d_1*d_2^3-144*t_1*t_2*d_0^2*
      d_1*d_2^3+108*t_2^2*d_0^2*d_1*d_2^3+216*t_0^2*d_0*d_1^2*d_2^3-288*t_0*t_1*d_0*d_1^2*d_2^3+180*t_1^2*d_0*d_1^2*d_2^
      3-144*t_0*t_2*d_0*d_1^2*d_2^3-72*t_1*t_2*d_0*d_1^2*d_2^3+108*t_2^2*d_0*d_1^2*d_2^3+72*t_0^2*d_1^3*d_2^3-72*t_0*t_1
      *d_1^3*d_2^3+36*t_1^2*d_1^3*d_2^3-72*t_0*t_2*d_1^3*d_2^3+36*t_2^2*d_1^3*d_2^3+36*t_0^2*d_0^2*d_2^4-72*t_0*t_1*d_0^
      2*d_2^4+36*t_1^2*d_0^2*d_2^4+72*t_0^2*d_0*d_1*d_2^4-144*t_0*t_1*d_0*d_1*d_2^4+72*t_1^2*d_0*d_1*d_2^4+36*t_0^2*d_1^
      2*d_2^4-72*t_0*t_1*d_1^2*d_2^4+36*t_1^2*d_1^2*d_2^4-216*d_0^4*d_1^3-216*d_0^3*d_1^4-648*d_0^4*d_1^2*d_2-1296*d_0^3
      *d_1^3*d_2-648*d_0^2*d_1^4*d_2-648*d_0^4*d_1*d_2^2-2160*d_0^3*d_1^2*d_2^2-2160*d_0^2*d_1^3*d_2^2-648*d_0*d_1^4*d_2
      ^2-216*d_0^4*d_2^3-1296*d_0^3*d_1*d_2^3-2160*d_0^2*d_1^2*d_2^3-1296*d_0*d_1^3*d_2^3-216*d_1^4*d_2^3-216*d_0^3*d_2^
      4-648*d_0^2*d_1*d_2^4-648*d_0*d_1^2*d_2^4-216*d_1^3*d_2^4

i37 : toString H2

o37 = t_0^2*t_1^6*d_0^3-6*t_0^2*t_1^5*t_2*d_0^3+15*t_0^2*t_1^4*t_2^2*d_0^3-20*t_0^2*t_1^3*t_2^3*d_0^3+15*t_0^2*t_1^2*t_2
      ^4*d_0^3-6*t_0^2*t_1*t_2^5*d_0^3+t_0^2*t_2^6*d_0^3+t_0^4*t_1^4*d_0^2*d_1+2*t_0^3*t_1^5*d_0^2*d_1-4*t_0^4*t_1^3*t_2
      *d_0^2*d_1-10*t_0^3*t_1^4*t_2*d_0^2*d_1-4*t_0^2*t_1^5*t_2*d_0^2*d_1+6*t_0^4*t_1^2*t_2^2*d_0^2*d_1+20*t_0^3*t_1^3*t
      _2^2*d_0^2*d_1+17*t_0^2*t_1^4*t_2^2*d_0^2*d_1+2*t_0*t_1^5*t_2^2*d_0^2*d_1-4*t_0^4*t_1*t_2^3*d_0^2*d_1-20*t_0^3*t_1
      ^2*t_2^3*d_0^2*d_1-28*t_0^2*t_1^3*t_2^3*d_0^2*d_1-8*t_0*t_1^4*t_2^3*d_0^2*d_1+t_0^4*t_2^4*d_0^2*d_1+10*t_0^3*t_1*t
      _2^4*d_0^2*d_1+22*t_0^2*t_1^2*t_2^4*d_0^2*d_1+12*t_0*t_1^3*t_2^4*d_0^2*d_1-2*t_0^3*t_2^5*d_0^2*d_1-8*t_0^2*t_1*t_2
      ^5*d_0^2*d_1-8*t_0*t_1^2*t_2^5*d_0^2*d_1+t_0^2*t_2^6*d_0^2*d_1+2*t_0*t_1*t_2^6*d_0^2*d_1+2*t_0^5*t_1^3*d_0*d_1^2+t
      _0^4*t_1^4*d_0*d_1^2-4*t_0^5*t_1^2*t_2*d_0*d_1^2-10*t_0^4*t_1^3*t_2*d_0*d_1^2-4*t_0^3*t_1^4*t_2*d_0*d_1^2+2*t_0^5*
      t_1*t_2^2*d_0*d_1^2+17*t_0^4*t_1^2*t_2^2*d_0*d_1^2+20*t_0^3*t_1^3*t_2^2*d_0*d_1^2+6*t_0^2*t_1^4*t_2^2*d_0*d_1^2-8*
      t_0^4*t_1*t_2^3*d_0*d_1^2-28*t_0^3*t_1^2*t_2^3*d_0*d_1^2-20*t_0^2*t_1^3*t_2^3*d_0*d_1^2-4*t_0*t_1^4*t_2^3*d_0*d_1^
      2+12*t_0^3*t_1*t_2^4*d_0*d_1^2+22*t_0^2*t_1^2*t_2^4*d_0*d_1^2+10*t_0*t_1^3*t_2^4*d_0*d_1^2+t_1^4*t_2^4*d_0*d_1^2-8
      *t_0^2*t_1*t_2^5*d_0*d_1^2-8*t_0*t_1^2*t_2^5*d_0*d_1^2-2*t_1^3*t_2^5*d_0*d_1^2+2*t_0*t_1*t_2^6*d_0*d_1^2+t_1^2*t_2
      ^6*d_0*d_1^2+t_0^6*t_1^2*d_1^3-6*t_0^5*t_1^2*t_2*d_1^3+15*t_0^4*t_1^2*t_2^2*d_1^3-20*t_0^3*t_1^2*t_2^3*d_1^3+15*t_
      0^2*t_1^2*t_2^4*d_1^3-6*t_0*t_1^2*t_2^5*d_1^3+t_1^2*t_2^6*d_1^3+t_0^4*t_1^4*d_0^2*d_2-2*t_0^3*t_1^5*d_0^2*d_2+t_0^
      2*t_1^6*d_0^2*d_2-4*t_0^4*t_1^3*t_2*d_0^2*d_2+10*t_0^3*t_1^4*t_2*d_0^2*d_2-8*t_0^2*t_1^5*t_2*d_0^2*d_2+2*t_0*t_1^6
      *t_2*d_0^2*d_2+6*t_0^4*t_1^2*t_2^2*d_0^2*d_2-20*t_0^3*t_1^3*t_2^2*d_0^2*d_2+22*t_0^2*t_1^4*t_2^2*d_0^2*d_2-8*t_0*t
      _1^5*t_2^2*d_0^2*d_2-4*t_0^4*t_1*t_2^3*d_0^2*d_2+20*t_0^3*t_1^2*t_2^3*d_0^2*d_2-28*t_0^2*t_1^3*t_2^3*d_0^2*d_2+12*
      t_0*t_1^4*t_2^3*d_0^2*d_2+t_0^4*t_2^4*d_0^2*d_2-10*t_0^3*t_1*t_2^4*d_0^2*d_2+17*t_0^2*t_1^2*t_2^4*d_0^2*d_2-8*t_0*
      t_1^3*t_2^4*d_0^2*d_2+2*t_0^3*t_2^5*d_0^2*d_2-4*t_0^2*t_1*t_2^5*d_0^2*d_2+2*t_0*t_1^2*t_2^5*d_0^2*d_2+2*t_0^5*t_1^
      3*d_0*d_1*d_2-4*t_0^4*t_1^4*d_0*d_1*d_2+2*t_0^3*t_1^5*d_0*d_1*d_2-2*t_0^5*t_1^2*t_2*d_0*d_1*d_2+2*t_0^4*t_1^3*t_2*
      d_0*d_1*d_2+2*t_0^3*t_1^4*t_2*d_0*d_1*d_2-2*t_0^2*t_1^5*t_2*d_0*d_1*d_2-2*t_0^5*t_1*t_2^2*d_0*d_1*d_2+4*t_0^4*t_1^
      2*t_2^2*d_0*d_1*d_2-4*t_0^3*t_1^3*t_2^2*d_0*d_1*d_2+4*t_0^2*t_1^4*t_2^2*d_0*d_1*d_2-2*t_0*t_1^5*t_2^2*d_0*d_1*d_2+
      2*t_0^5*t_2^3*d_0*d_1*d_2+2*t_0^4*t_1*t_2^3*d_0*d_1*d_2-4*t_0^3*t_1^2*t_2^3*d_0*d_1*d_2-4*t_0^2*t_1^3*t_2^3*d_0*d_
      1*d_2+2*t_0*t_1^4*t_2^3*d_0*d_1*d_2+2*t_1^5*t_2^3*d_0*d_1*d_2-4*t_0^4*t_2^4*d_0*d_1*d_2+2*t_0^3*t_1*t_2^4*d_0*d_1*
      d_2+4*t_0^2*t_1^2*t_2^4*d_0*d_1*d_2+2*t_0*t_1^3*t_2^4*d_0*d_1*d_2-4*t_1^4*t_2^4*d_0*d_1*d_2+2*t_0^3*t_2^5*d_0*d_1*
      d_2-2*t_0^2*t_1*t_2^5*d_0*d_1*d_2-2*t_0*t_1^2*t_2^5*d_0*d_1*d_2+2*t_1^3*t_2^5*d_0*d_1*d_2+t_0^6*t_1^2*d_1^2*d_2-2*
      t_0^5*t_1^3*d_1^2*d_2+t_0^4*t_1^4*d_1^2*d_2+2*t_0^6*t_1*t_2*d_1^2*d_2-8*t_0^5*t_1^2*t_2*d_1^2*d_2+10*t_0^4*t_1^3*t
      _2*d_1^2*d_2-4*t_0^3*t_1^4*t_2*d_1^2*d_2-8*t_0^5*t_1*t_2^2*d_1^2*d_2+22*t_0^4*t_1^2*t_2^2*d_1^2*d_2-20*t_0^3*t_1^3
      *t_2^2*d_1^2*d_2+6*t_0^2*t_1^4*t_2^2*d_1^2*d_2+12*t_0^4*t_1*t_2^3*d_1^2*d_2-28*t_0^3*t_1^2*t_2^3*d_1^2*d_2+20*t_0^
      2*t_1^3*t_2^3*d_1^2*d_2-4*t_0*t_1^4*t_2^3*d_1^2*d_2-8*t_0^3*t_1*t_2^4*d_1^2*d_2+17*t_0^2*t_1^2*t_2^4*d_1^2*d_2-10*
      t_0*t_1^3*t_2^4*d_1^2*d_2+t_1^4*t_2^4*d_1^2*d_2+2*t_0^2*t_1*t_2^5*d_1^2*d_2-4*t_0*t_1^2*t_2^5*d_1^2*d_2+2*t_1^3*t_
      2^5*d_1^2*d_2+2*t_0^5*t_1^2*t_2*d_0*d_2^2-8*t_0^4*t_1^3*t_2*d_0*d_2^2+12*t_0^3*t_1^4*t_2*d_0*d_2^2-8*t_0^2*t_1^5*t
      _2*d_0*d_2^2+2*t_0*t_1^6*t_2*d_0*d_2^2-4*t_0^5*t_1*t_2^2*d_0*d_2^2+17*t_0^4*t_1^2*t_2^2*d_0*d_2^2-28*t_0^3*t_1^3*t
      _2^2*d_0*d_2^2+22*t_0^2*t_1^4*t_2^2*d_0*d_2^2-8*t_0*t_1^5*t_2^2*d_0*d_2^2+t_1^6*t_2^2*d_0*d_2^2+2*t_0^5*t_2^3*d_0*
      d_2^2-10*t_0^4*t_1*t_2^3*d_0*d_2^2+20*t_0^3*t_1^2*t_2^3*d_0*d_2^2-20*t_0^2*t_1^3*t_2^3*d_0*d_2^2+10*t_0*t_1^4*t_2^
      3*d_0*d_2^2-2*t_1^5*t_2^3*d_0*d_2^2+t_0^4*t_2^4*d_0*d_2^2-4*t_0^3*t_1*t_2^4*d_0*d_2^2+6*t_0^2*t_1^2*t_2^4*d_0*d_2^
      2-4*t_0*t_1^3*t_2^4*d_0*d_2^2+t_1^4*t_2^4*d_0*d_2^2+2*t_0^6*t_1*t_2*d_1*d_2^2-8*t_0^5*t_1^2*t_2*d_1*d_2^2+12*t_0^4
      *t_1^3*t_2*d_1*d_2^2-8*t_0^3*t_1^4*t_2*d_1*d_2^2+2*t_0^2*t_1^5*t_2*d_1*d_2^2+t_0^6*t_2^2*d_1*d_2^2-8*t_0^5*t_1*t_2
      ^2*d_1*d_2^2+22*t_0^4*t_1^2*t_2^2*d_1*d_2^2-28*t_0^3*t_1^3*t_2^2*d_1*d_2^2+17*t_0^2*t_1^4*t_2^2*d_1*d_2^2-4*t_0*t_
      1^5*t_2^2*d_1*d_2^2-2*t_0^5*t_2^3*d_1*d_2^2+10*t_0^4*t_1*t_2^3*d_1*d_2^2-20*t_0^3*t_1^2*t_2^3*d_1*d_2^2+20*t_0^2*t
      _1^3*t_2^3*d_1*d_2^2-10*t_0*t_1^4*t_2^3*d_1*d_2^2+2*t_1^5*t_2^3*d_1*d_2^2+t_0^4*t_2^4*d_1*d_2^2-4*t_0^3*t_1*t_2^4*
      d_1*d_2^2+6*t_0^2*t_1^2*t_2^4*d_1*d_2^2-4*t_0*t_1^3*t_2^4*d_1*d_2^2+t_1^4*t_2^4*d_1*d_2^2+t_0^6*t_2^2*d_2^3-6*t_0^
      5*t_1*t_2^2*d_2^3+15*t_0^4*t_1^2*t_2^2*d_2^3-20*t_0^3*t_1^3*t_2^2*d_2^3+15*t_0^2*t_1^4*t_2^2*d_2^3-6*t_0*t_1^5*t_2
      ^2*d_2^3+t_1^6*t_2^2*d_2^3-4*t_1^6*d_0^4+24*t_1^5*t_2*d_0^4-60*t_1^4*t_2^2*d_0^4+80*t_1^3*t_2^3*d_0^4-60*t_1^2*t_2
      ^4*d_0^4+24*t_1*t_2^5*d_0^4-4*t_2^6*d_0^4-30*t_0^2*t_1^4*d_0^3*d_1-6*t_0*t_1^5*d_0^3*d_1+120*t_0^2*t_1^3*t_2*d_0^3
      *d_1+36*t_0*t_1^4*t_2*d_0^3*d_1+24*t_1^5*t_2*d_0^3*d_1-180*t_0^2*t_1^2*t_2^2*d_0^3*d_1-84*t_0*t_1^3*t_2^2*d_0^3*d_
      1-96*t_1^4*t_2^2*d_0^3*d_1+120*t_0^2*t_1*t_2^3*d_0^3*d_1+96*t_0*t_1^2*t_2^3*d_0^3*d_1+144*t_1^3*t_2^3*d_0^3*d_1-30
      *t_0^2*t_2^4*d_0^3*d_1-54*t_0*t_1*t_2^4*d_0^3*d_1-96*t_1^2*t_2^4*d_0^3*d_1+12*t_0*t_2^5*d_0^3*d_1+24*t_1*t_2^5*d_0
      ^3*d_1-18*t_0^4*t_1^2*d_0^2*d_1^2-28*t_0^3*t_1^3*d_0^2*d_1^2-18*t_0^2*t_1^4*d_0^2*d_1^2+36*t_0^4*t_1*t_2*d_0^2*d_1
      ^2+120*t_0^3*t_1^2*t_2*d_0^2*d_1^2+120*t_0^2*t_1^3*t_2*d_0^2*d_1^2+36*t_0*t_1^4*t_2*d_0^2*d_1^2-18*t_0^4*t_2^2*d_0
      ^2*d_1^2-156*t_0^3*t_1*t_2^2*d_0^2*d_1^2-252*t_0^2*t_1^2*t_2^2*d_0^2*d_1^2-156*t_0*t_1^3*t_2^2*d_0^2*d_1^2-18*t_1^
      4*t_2^2*d_0^2*d_1^2+64*t_0^3*t_2^3*d_0^2*d_1^2+216*t_0^2*t_1*t_2^3*d_0^2*d_1^2+216*t_0*t_1^2*t_2^3*d_0^2*d_1^2+64*
      t_1^3*t_2^3*d_0^2*d_1^2-66*t_0^2*t_2^4*d_0^2*d_1^2-108*t_0*t_1*t_2^4*d_0^2*d_1^2-66*t_1^2*t_2^4*d_0^2*d_1^2+12*t_0
      *t_2^5*d_0^2*d_1^2+12*t_1*t_2^5*d_0^2*d_1^2+8*t_2^6*d_0^2*d_1^2-6*t_0^5*t_1*d_0*d_1^3-30*t_0^4*t_1^2*d_0*d_1^3+24*
      t_0^5*t_2*d_0*d_1^3+36*t_0^4*t_1*t_2*d_0*d_1^3+120*t_0^3*t_1^2*t_2*d_0*d_1^3-96*t_0^4*t_2^2*d_0*d_1^3-84*t_0^3*t_1
      *t_2^2*d_0*d_1^3-180*t_0^2*t_1^2*t_2^2*d_0*d_1^3+144*t_0^3*t_2^3*d_0*d_1^3+96*t_0^2*t_1*t_2^3*d_0*d_1^3+120*t_0*t_
      1^2*t_2^3*d_0*d_1^3-96*t_0^2*t_2^4*d_0*d_1^3-54*t_0*t_1*t_2^4*d_0*d_1^3-30*t_1^2*t_2^4*d_0*d_1^3+24*t_0*t_2^5*d_0*
      d_1^3+12*t_1*t_2^5*d_0*d_1^3-4*t_0^6*d_1^4+24*t_0^5*t_2*d_1^4-60*t_0^4*t_2^2*d_1^4+80*t_0^3*t_2^3*d_1^4-60*t_0^2*t
      _2^4*d_1^4+24*t_0*t_2^5*d_1^4-4*t_2^6*d_1^4-30*t_0^2*t_1^4*d_0^3*d_2+12*t_0*t_1^5*d_0^3*d_2+120*t_0^2*t_1^3*t_2*d_
      0^3*d_2-54*t_0*t_1^4*t_2*d_0^3*d_2+24*t_1^5*t_2*d_0^3*d_2-180*t_0^2*t_1^2*t_2^2*d_0^3*d_2+96*t_0*t_1^3*t_2^2*d_0^3
      *d_2-96*t_1^4*t_2^2*d_0^3*d_2+120*t_0^2*t_1*t_2^3*d_0^3*d_2-84*t_0*t_1^2*t_2^3*d_0^3*d_2+144*t_1^3*t_2^3*d_0^3*d_2
      -30*t_0^2*t_2^4*d_0^3*d_2+36*t_0*t_1*t_2^4*d_0^3*d_2-96*t_1^2*t_2^4*d_0^3*d_2-6*t_0*t_2^5*d_0^3*d_2+24*t_1*t_2^5*d
      _0^3*d_2-36*t_0^4*t_1^2*d_0^2*d_1*d_2+36*t_0^3*t_1^3*d_0^2*d_1*d_2-66*t_0^2*t_1^4*d_0^2*d_1*d_2+12*t_0*t_1^5*d_0^2
      *d_1*d_2+72*t_0^4*t_1*t_2*d_0^2*d_1*d_2-36*t_0^3*t_1^2*t_2*d_0^2*d_1*d_2+264*t_0^2*t_1^3*t_2*d_0^2*d_1*d_2-72*t_0*
      t_1^4*t_2*d_0^2*d_1*d_2+42*t_1^5*t_2*d_0^2*d_1*d_2-36*t_0^4*t_2^2*d_0^2*d_1*d_2-36*t_0^3*t_1*t_2^2*d_0^2*d_1*d_2-
      396*t_0^2*t_1^2*t_2^2*d_0^2*d_1*d_2+60*t_0*t_1^3*t_2^2*d_0^2*d_1*d_2-132*t_1^4*t_2^2*d_0^2*d_1*d_2+36*t_0^3*t_2^3*
      d_0^2*d_1*d_2+264*t_0^2*t_1*t_2^3*d_0^2*d_1*d_2+60*t_0*t_1^2*t_2^3*d_0^2*d_1*d_2+180*t_1^3*t_2^3*d_0^2*d_1*d_2-66*
      t_0^2*t_2^4*d_0^2*d_1*d_2-72*t_0*t_1*t_2^4*d_0^2*d_1*d_2-132*t_1^2*t_2^4*d_0^2*d_1*d_2+12*t_0*t_2^5*d_0^2*d_1*d_2+
      42*t_1*t_2^5*d_0^2*d_1*d_2+12*t_0^5*t_1*d_0*d_1^2*d_2-66*t_0^4*t_1^2*d_0*d_1^2*d_2+36*t_0^3*t_1^3*d_0*d_1^2*d_2-36
      *t_0^2*t_1^4*d_0*d_1^2*d_2+42*t_0^5*t_2*d_0*d_1^2*d_2-72*t_0^4*t_1*t_2*d_0*d_1^2*d_2+264*t_0^3*t_1^2*t_2*d_0*d_1^2
      *d_2-36*t_0^2*t_1^3*t_2*d_0*d_1^2*d_2+72*t_0*t_1^4*t_2*d_0*d_1^2*d_2-132*t_0^4*t_2^2*d_0*d_1^2*d_2+60*t_0^3*t_1*t_
      2^2*d_0*d_1^2*d_2-396*t_0^2*t_1^2*t_2^2*d_0*d_1^2*d_2-36*t_0*t_1^3*t_2^2*d_0*d_1^2*d_2-36*t_1^4*t_2^2*d_0*d_1^2*d_
      2+180*t_0^3*t_2^3*d_0*d_1^2*d_2+60*t_0^2*t_1*t_2^3*d_0*d_1^2*d_2+264*t_0*t_1^2*t_2^3*d_0*d_1^2*d_2+36*t_1^3*t_2^3*
      d_0*d_1^2*d_2-132*t_0^2*t_2^4*d_0*d_1^2*d_2-72*t_0*t_1*t_2^4*d_0*d_1^2*d_2-66*t_1^2*t_2^4*d_0*d_1^2*d_2+42*t_0*t_2
      ^5*d_0*d_1^2*d_2+12*t_1*t_2^5*d_0*d_1^2*d_2+12*t_0^5*t_1*d_1^3*d_2-30*t_0^4*t_1^2*d_1^3*d_2+24*t_0^5*t_2*d_1^3*d_2
      -54*t_0^4*t_1*t_2*d_1^3*d_2+120*t_0^3*t_1^2*t_2*d_1^3*d_2-96*t_0^4*t_2^2*d_1^3*d_2+96*t_0^3*t_1*t_2^2*d_1^3*d_2-
      180*t_0^2*t_1^2*t_2^2*d_1^3*d_2+144*t_0^3*t_2^3*d_1^3*d_2-84*t_0^2*t_1*t_2^3*d_1^3*d_2+120*t_0*t_1^2*t_2^3*d_1^3*d
      _2-96*t_0^2*t_2^4*d_1^3*d_2+36*t_0*t_1*t_2^4*d_1^3*d_2-30*t_1^2*t_2^4*d_1^3*d_2+24*t_0*t_2^5*d_1^3*d_2-6*t_1*t_2^5
      *d_1^3*d_2-18*t_0^4*t_1^2*d_0^2*d_2^2+64*t_0^3*t_1^3*d_0^2*d_2^2-66*t_0^2*t_1^4*d_0^2*d_2^2+12*t_0*t_1^5*d_0^2*d_2
      ^2+8*t_1^6*d_0^2*d_2^2+36*t_0^4*t_1*t_2*d_0^2*d_2^2-156*t_0^3*t_1^2*t_2*d_0^2*d_2^2+216*t_0^2*t_1^3*t_2*d_0^2*d_2^
      2-108*t_0*t_1^4*t_2*d_0^2*d_2^2+12*t_1^5*t_2*d_0^2*d_2^2-18*t_0^4*t_2^2*d_0^2*d_2^2+120*t_0^3*t_1*t_2^2*d_0^2*d_2^
      2-252*t_0^2*t_1^2*t_2^2*d_0^2*d_2^2+216*t_0*t_1^3*t_2^2*d_0^2*d_2^2-66*t_1^4*t_2^2*d_0^2*d_2^2-28*t_0^3*t_2^3*d_0^
      2*d_2^2+120*t_0^2*t_1*t_2^3*d_0^2*d_2^2-156*t_0*t_1^2*t_2^3*d_0^2*d_2^2+64*t_1^3*t_2^3*d_0^2*d_2^2-18*t_0^2*t_2^4*
      d_0^2*d_2^2+36*t_0*t_1*t_2^4*d_0^2*d_2^2-18*t_1^2*t_2^4*d_0^2*d_2^2+42*t_0^5*t_1*d_0*d_1*d_2^2-132*t_0^4*t_1^2*d_0
      *d_1*d_2^2+180*t_0^3*t_1^3*d_0*d_1*d_2^2-132*t_0^2*t_1^4*d_0*d_1*d_2^2+42*t_0*t_1^5*d_0*d_1*d_2^2+12*t_0^5*t_2*d_0
      *d_1*d_2^2-72*t_0^4*t_1*t_2*d_0*d_1*d_2^2+60*t_0^3*t_1^2*t_2*d_0*d_1*d_2^2+60*t_0^2*t_1^3*t_2*d_0*d_1*d_2^2-72*t_0
      *t_1^4*t_2*d_0*d_1*d_2^2+12*t_1^5*t_2*d_0*d_1*d_2^2-66*t_0^4*t_2^2*d_0*d_1*d_2^2+264*t_0^3*t_1*t_2^2*d_0*d_1*d_2^2
      -396*t_0^2*t_1^2*t_2^2*d_0*d_1*d_2^2+264*t_0*t_1^3*t_2^2*d_0*d_1*d_2^2-66*t_1^4*t_2^2*d_0*d_1*d_2^2+36*t_0^3*t_2^3
      *d_0*d_1*d_2^2-36*t_0^2*t_1*t_2^3*d_0*d_1*d_2^2-36*t_0*t_1^2*t_2^3*d_0*d_1*d_2^2+36*t_1^3*t_2^3*d_0*d_1*d_2^2-36*t
      _0^2*t_2^4*d_0*d_1*d_2^2+72*t_0*t_1*t_2^4*d_0*d_1*d_2^2-36*t_1^2*t_2^4*d_0*d_1*d_2^2+8*t_0^6*d_1^2*d_2^2+12*t_0^5*
      t_1*d_1^2*d_2^2-66*t_0^4*t_1^2*d_1^2*d_2^2+64*t_0^3*t_1^3*d_1^2*d_2^2-18*t_0^2*t_1^4*d_1^2*d_2^2+12*t_0^5*t_2*d_1^
      2*d_2^2-108*t_0^4*t_1*t_2*d_1^2*d_2^2+216*t_0^3*t_1^2*t_2*d_1^2*d_2^2-156*t_0^2*t_1^3*t_2*d_1^2*d_2^2+36*t_0*t_1^4
      *t_2*d_1^2*d_2^2-66*t_0^4*t_2^2*d_1^2*d_2^2+216*t_0^3*t_1*t_2^2*d_1^2*d_2^2-252*t_0^2*t_1^2*t_2^2*d_1^2*d_2^2+120*
      t_0*t_1^3*t_2^2*d_1^2*d_2^2-18*t_1^4*t_2^2*d_1^2*d_2^2+64*t_0^3*t_2^3*d_1^2*d_2^2-156*t_0^2*t_1*t_2^3*d_1^2*d_2^2+
      120*t_0*t_1^2*t_2^3*d_1^2*d_2^2-28*t_1^3*t_2^3*d_1^2*d_2^2-18*t_0^2*t_2^4*d_1^2*d_2^2+36*t_0*t_1*t_2^4*d_1^2*d_2^2
      -18*t_1^2*t_2^4*d_1^2*d_2^2+24*t_0^5*t_1*d_0*d_2^3-96*t_0^4*t_1^2*d_0*d_2^3+144*t_0^3*t_1^3*d_0*d_2^3-96*t_0^2*t_1
      ^4*d_0*d_2^3+24*t_0*t_1^5*d_0*d_2^3-6*t_0^5*t_2*d_0*d_2^3+36*t_0^4*t_1*t_2*d_0*d_2^3-84*t_0^3*t_1^2*t_2*d_0*d_2^3+
      96*t_0^2*t_1^3*t_2*d_0*d_2^3-54*t_0*t_1^4*t_2*d_0*d_2^3+12*t_1^5*t_2*d_0*d_2^3-30*t_0^4*t_2^2*d_0*d_2^3+120*t_0^3*
      t_1*t_2^2*d_0*d_2^3-180*t_0^2*t_1^2*t_2^2*d_0*d_2^3+120*t_0*t_1^3*t_2^2*d_0*d_2^3-30*t_1^4*t_2^2*d_0*d_2^3+24*t_0^
      5*t_1*d_1*d_2^3-96*t_0^4*t_1^2*d_1*d_2^3+144*t_0^3*t_1^3*d_1*d_2^3-96*t_0^2*t_1^4*d_1*d_2^3+24*t_0*t_1^5*d_1*d_2^3
      +12*t_0^5*t_2*d_1*d_2^3-54*t_0^4*t_1*t_2*d_1*d_2^3+96*t_0^3*t_1^2*t_2*d_1*d_2^3-84*t_0^2*t_1^3*t_2*d_1*d_2^3+36*t_
      0*t_1^4*t_2*d_1*d_2^3-6*t_1^5*t_2*d_1*d_2^3-30*t_0^4*t_2^2*d_1*d_2^3+120*t_0^3*t_1*t_2^2*d_1*d_2^3-180*t_0^2*t_1^2
      *t_2^2*d_1*d_2^3+120*t_0*t_1^3*t_2^2*d_1*d_2^3-30*t_1^4*t_2^2*d_1*d_2^3-4*t_0^6*d_2^4+24*t_0^5*t_1*d_2^4-60*t_0^4*
      t_1^2*d_2^4+80*t_0^3*t_1^3*d_2^4-60*t_0^2*t_1^4*d_2^4+24*t_0*t_1^5*d_2^4-4*t_1^6*d_2^4+108*t_1^4*d_0^4*d_1-432*t_1
      ^3*t_2*d_0^4*d_1+648*t_1^2*t_2^2*d_0^4*d_1-432*t_1*t_2^3*d_0^4*d_1+108*t_2^4*d_0^4*d_1+297*t_0^2*t_1^2*d_0^3*d_1^2
      +54*t_0*t_1^3*d_0^3*d_1^2+81*t_1^4*d_0^3*d_1^2-594*t_0^2*t_1*t_2*d_0^3*d_1^2-432*t_0*t_1^2*t_2*d_0^3*d_1^2-486*t_1
      ^3*t_2*d_0^3*d_1^2+297*t_0^2*t_2^2*d_0^3*d_1^2+702*t_0*t_1*t_2^2*d_0^3*d_1^2+945*t_1^2*t_2^2*d_0^3*d_1^2-324*t_0*t
      _2^3*d_0^3*d_1^2-756*t_1*t_2^3*d_0^3*d_1^2+216*t_2^4*d_0^3*d_1^2+81*t_0^4*d_0^2*d_1^3+54*t_0^3*t_1*d_0^2*d_1^3+297
      *t_0^2*t_1^2*d_0^2*d_1^3-486*t_0^3*t_2*d_0^2*d_1^3-432*t_0^2*t_1*t_2*d_0^2*d_1^3-594*t_0*t_1^2*t_2*d_0^2*d_1^3+945
      *t_0^2*t_2^2*d_0^2*d_1^3+702*t_0*t_1*t_2^2*d_0^2*d_1^3+297*t_1^2*t_2^2*d_0^2*d_1^3-756*t_0*t_2^3*d_0^2*d_1^3-324*t
      _1*t_2^3*d_0^2*d_1^3+216*t_2^4*d_0^2*d_1^3+108*t_0^4*d_0*d_1^4-432*t_0^3*t_2*d_0*d_1^4+648*t_0^2*t_2^2*d_0*d_1^4-
      432*t_0*t_2^3*d_0*d_1^4+108*t_2^4*d_0*d_1^4+108*t_1^4*d_0^4*d_2-432*t_1^3*t_2*d_0^4*d_2+648*t_1^2*t_2^2*d_0^4*d_2-
      432*t_1*t_2^3*d_0^4*d_2+108*t_2^4*d_0^4*d_2+594*t_0^2*t_1^2*d_0^3*d_1*d_2-270*t_0*t_1^3*d_0^3*d_1*d_2+324*t_1^4*d_
      0^3*d_1*d_2-1188*t_0^2*t_1*t_2*d_0^3*d_1*d_2+270*t_0*t_1^2*t_2*d_0^3*d_1*d_2-1350*t_1^3*t_2*d_0^3*d_1*d_2+594*t_0^
      2*t_2^2*d_0^3*d_1*d_2+270*t_0*t_1*t_2^2*d_0^3*d_1*d_2+2052*t_1^2*t_2^2*d_0^3*d_1*d_2-270*t_0*t_2^3*d_0^3*d_1*d_2-
      1350*t_1*t_2^3*d_0^3*d_1*d_2+324*t_2^4*d_0^3*d_1*d_2+243*t_0^4*d_0^2*d_1^2*d_2-378*t_0^3*t_1*d_0^2*d_1^2*d_2+1350*
      t_0^2*t_1^2*d_0^2*d_1^2*d_2-378*t_0*t_1^3*d_0^2*d_1^2*d_2+243*t_1^4*d_0^2*d_1^2*d_2-918*t_0^3*t_2*d_0^2*d_1^2*d_2-
      918*t_0^2*t_1*t_2*d_0^2*d_1^2*d_2-918*t_0*t_1^2*t_2*d_0^2*d_1^2*d_2-918*t_1^3*t_2*d_0^2*d_1^2*d_2+1998*t_0^2*t_2^2
      *d_0^2*d_1^2*d_2+540*t_0*t_1*t_2^2*d_0^2*d_1^2*d_2+1998*t_1^2*t_2^2*d_0^2*d_1^2*d_2-1188*t_0*t_2^3*d_0^2*d_1^2*d_2
      -1188*t_1*t_2^3*d_0^2*d_1^2*d_2+432*t_2^4*d_0^2*d_1^2*d_2+324*t_0^4*d_0*d_1^3*d_2-270*t_0^3*t_1*d_0*d_1^3*d_2+594*
      t_0^2*t_1^2*d_0*d_1^3*d_2-1350*t_0^3*t_2*d_0*d_1^3*d_2+270*t_0^2*t_1*t_2*d_0*d_1^3*d_2-1188*t_0*t_1^2*t_2*d_0*d_1^
      3*d_2+2052*t_0^2*t_2^2*d_0*d_1^3*d_2+270*t_0*t_1*t_2^2*d_0*d_1^3*d_2+594*t_1^2*t_2^2*d_0*d_1^3*d_2-1350*t_0*t_2^3*
      d_0*d_1^3*d_2-270*t_1*t_2^3*d_0*d_1^3*d_2+324*t_2^4*d_0*d_1^3*d_2+108*t_0^4*d_1^4*d_2-432*t_0^3*t_2*d_1^4*d_2+648*
      t_0^2*t_2^2*d_1^4*d_2-432*t_0*t_2^3*d_1^4*d_2+108*t_2^4*d_1^4*d_2+297*t_0^2*t_1^2*d_0^3*d_2^2-324*t_0*t_1^3*d_0^3*
      d_2^2+216*t_1^4*d_0^3*d_2^2-594*t_0^2*t_1*t_2*d_0^3*d_2^2+702*t_0*t_1^2*t_2*d_0^3*d_2^2-756*t_1^3*t_2*d_0^3*d_2^2+
      297*t_0^2*t_2^2*d_0^3*d_2^2-432*t_0*t_1*t_2^2*d_0^3*d_2^2+945*t_1^2*t_2^2*d_0^3*d_2^2+54*t_0*t_2^3*d_0^3*d_2^2-486
      *t_1*t_2^3*d_0^3*d_2^2+81*t_2^4*d_0^3*d_2^2+243*t_0^4*d_0^2*d_1*d_2^2-918*t_0^3*t_1*d_0^2*d_1*d_2^2+1998*t_0^2*t_1
      ^2*d_0^2*d_1*d_2^2-1188*t_0*t_1^3*d_0^2*d_1*d_2^2+432*t_1^4*d_0^2*d_1*d_2^2-378*t_0^3*t_2*d_0^2*d_1*d_2^2-918*t_0^
      2*t_1*t_2*d_0^2*d_1*d_2^2+540*t_0*t_1^2*t_2*d_0^2*d_1*d_2^2-1188*t_1^3*t_2*d_0^2*d_1*d_2^2+1350*t_0^2*t_2^2*d_0^2*
      d_1*d_2^2-918*t_0*t_1*t_2^2*d_0^2*d_1*d_2^2+1998*t_1^2*t_2^2*d_0^2*d_1*d_2^2-378*t_0*t_2^3*d_0^2*d_1*d_2^2-918*t_1
      *t_2^3*d_0^2*d_1*d_2^2+243*t_2^4*d_0^2*d_1*d_2^2+432*t_0^4*d_0*d_1^2*d_2^2-1188*t_0^3*t_1*d_0*d_1^2*d_2^2+1998*t_0
      ^2*t_1^2*d_0*d_1^2*d_2^2-918*t_0*t_1^3*d_0*d_1^2*d_2^2+243*t_1^4*d_0*d_1^2*d_2^2-1188*t_0^3*t_2*d_0*d_1^2*d_2^2+
      540*t_0^2*t_1*t_2*d_0*d_1^2*d_2^2-918*t_0*t_1^2*t_2*d_0*d_1^2*d_2^2-378*t_1^3*t_2*d_0*d_1^2*d_2^2+1998*t_0^2*t_2^2
      *d_0*d_1^2*d_2^2-918*t_0*t_1*t_2^2*d_0*d_1^2*d_2^2+1350*t_1^2*t_2^2*d_0*d_1^2*d_2^2-918*t_0*t_2^3*d_0*d_1^2*d_2^2-
      378*t_1*t_2^3*d_0*d_1^2*d_2^2+243*t_2^4*d_0*d_1^2*d_2^2+216*t_0^4*d_1^3*d_2^2-324*t_0^3*t_1*d_1^3*d_2^2+297*t_0^2*
      t_1^2*d_1^3*d_2^2-756*t_0^3*t_2*d_1^3*d_2^2+702*t_0^2*t_1*t_2*d_1^3*d_2^2-594*t_0*t_1^2*t_2*d_1^3*d_2^2+945*t_0^2*
      t_2^2*d_1^3*d_2^2-432*t_0*t_1*t_2^2*d_1^3*d_2^2+297*t_1^2*t_2^2*d_1^3*d_2^2-486*t_0*t_2^3*d_1^3*d_2^2+54*t_1*t_2^3
      *d_1^3*d_2^2+81*t_2^4*d_1^3*d_2^2+81*t_0^4*d_0^2*d_2^3-486*t_0^3*t_1*d_0^2*d_2^3+945*t_0^2*t_1^2*d_0^2*d_2^3-756*t
      _0*t_1^3*d_0^2*d_2^3+216*t_1^4*d_0^2*d_2^3+54*t_0^3*t_2*d_0^2*d_2^3-432*t_0^2*t_1*t_2*d_0^2*d_2^3+702*t_0*t_1^2*t_
      2*d_0^2*d_2^3-324*t_1^3*t_2*d_0^2*d_2^3+297*t_0^2*t_2^2*d_0^2*d_2^3-594*t_0*t_1*t_2^2*d_0^2*d_2^3+297*t_1^2*t_2^2*
      d_0^2*d_2^3+324*t_0^4*d_0*d_1*d_2^3-1350*t_0^3*t_1*d_0*d_1*d_2^3+2052*t_0^2*t_1^2*d_0*d_1*d_2^3-1350*t_0*t_1^3*d_0
      *d_1*d_2^3+324*t_1^4*d_0*d_1*d_2^3-270*t_0^3*t_2*d_0*d_1*d_2^3+270*t_0^2*t_1*t_2*d_0*d_1*d_2^3+270*t_0*t_1^2*t_2*d
      _0*d_1*d_2^3-270*t_1^3*t_2*d_0*d_1*d_2^3+594*t_0^2*t_2^2*d_0*d_1*d_2^3-1188*t_0*t_1*t_2^2*d_0*d_1*d_2^3+594*t_1^2*
      t_2^2*d_0*d_1*d_2^3+216*t_0^4*d_1^2*d_2^3-756*t_0^3*t_1*d_1^2*d_2^3+945*t_0^2*t_1^2*d_1^2*d_2^3-486*t_0*t_1^3*d_1^
      2*d_2^3+81*t_1^4*d_1^2*d_2^3-324*t_0^3*t_2*d_1^2*d_2^3+702*t_0^2*t_1*t_2*d_1^2*d_2^3-432*t_0*t_1^2*t_2*d_1^2*d_2^3
      +54*t_1^3*t_2*d_1^2*d_2^3+297*t_0^2*t_2^2*d_1^2*d_2^3-594*t_0*t_1*t_2^2*d_1^2*d_2^3+297*t_1^2*t_2^2*d_1^2*d_2^3+
      108*t_0^4*d_0*d_2^4-432*t_0^3*t_1*d_0*d_2^4+648*t_0^2*t_1^2*d_0*d_2^4-432*t_0*t_1^3*d_0*d_2^4+108*t_1^4*d_0*d_2^4+
      108*t_0^4*d_1*d_2^4-432*t_0^3*t_1*d_1*d_2^4+648*t_0^2*t_1^2*d_1*d_2^4-432*t_0*t_1^3*d_1*d_2^4+108*t_1^4*d_1*d_2^4-
      972*t_1^2*d_0^4*d_1^2+1944*t_1*t_2*d_0^4*d_1^2-972*t_2^2*d_0^4*d_1^2-972*t_0^2*d_0^3*d_1^3-972*t_1^2*d_0^3*d_1^3+
      1944*t_0*t_2*d_0^3*d_1^3+1944*t_1*t_2*d_0^3*d_1^3-1944*t_2^2*d_0^3*d_1^3-972*t_0^2*d_0^2*d_1^4+1944*t_0*t_2*d_0^2*
      d_1^4-972*t_2^2*d_0^2*d_1^4-1944*t_1^2*d_0^4*d_1*d_2+3888*t_1*t_2*d_0^4*d_1*d_2-1944*t_2^2*d_0^4*d_1*d_2-2916*t_0^
      2*d_0^3*d_1^2*d_2+1944*t_0*t_1*d_0^3*d_1^2*d_2-4860*t_1^2*d_0^3*d_1^2*d_2+3888*t_0*t_2*d_0^3*d_1^2*d_2+7776*t_1*t_
      2*d_0^3*d_1^2*d_2-5832*t_2^2*d_0^3*d_1^2*d_2-4860*t_0^2*d_0^2*d_1^3*d_2+1944*t_0*t_1*d_0^2*d_1^3*d_2-2916*t_1^2*d_
      0^2*d_1^3*d_2+7776*t_0*t_2*d_0^2*d_1^3*d_2+3888*t_1*t_2*d_0^2*d_1^3*d_2-5832*t_2^2*d_0^2*d_1^3*d_2-1944*t_0^2*d_0*
      d_1^4*d_2+3888*t_0*t_2*d_0*d_1^4*d_2-1944*t_2^2*d_0*d_1^4*d_2-972*t_1^2*d_0^4*d_2^2+1944*t_1*t_2*d_0^4*d_2^2-972*t
      _2^2*d_0^4*d_2^2-2916*t_0^2*d_0^3*d_1*d_2^2+3888*t_0*t_1*d_0^3*d_1*d_2^2-5832*t_1^2*d_0^3*d_1*d_2^2+1944*t_0*t_2*d
      _0^3*d_1*d_2^2+7776*t_1*t_2*d_0^3*d_1*d_2^2-4860*t_2^2*d_0^3*d_1*d_2^2-7776*t_0^2*d_0^2*d_1^2*d_2^2+7776*t_0*t_1*d
      _0^2*d_1^2*d_2^2-7776*t_1^2*d_0^2*d_1^2*d_2^2+7776*t_0*t_2*d_0^2*d_1^2*d_2^2+7776*t_1*t_2*d_0^2*d_1^2*d_2^2-7776*t
      _2^2*d_0^2*d_1^2*d_2^2-5832*t_0^2*d_0*d_1^3*d_2^2+3888*t_0*t_1*d_0*d_1^3*d_2^2-2916*t_1^2*d_0*d_1^3*d_2^2+7776*t_0
      *t_2*d_0*d_1^3*d_2^2+1944*t_1*t_2*d_0*d_1^3*d_2^2-4860*t_2^2*d_0*d_1^3*d_2^2-972*t_0^2*d_1^4*d_2^2+1944*t_0*t_2*d_
      1^4*d_2^2-972*t_2^2*d_1^4*d_2^2-972*t_0^2*d_0^3*d_2^3+1944*t_0*t_1*d_0^3*d_2^3-1944*t_1^2*d_0^3*d_2^3+1944*t_1*t_2
      *d_0^3*d_2^3-972*t_2^2*d_0^3*d_2^3-4860*t_0^2*d_0^2*d_1*d_2^3+7776*t_0*t_1*d_0^2*d_1*d_2^3-5832*t_1^2*d_0^2*d_1*d_
      2^3+1944*t_0*t_2*d_0^2*d_1*d_2^3+3888*t_1*t_2*d_0^2*d_1*d_2^3-2916*t_2^2*d_0^2*d_1*d_2^3-5832*t_0^2*d_0*d_1^2*d_2^
      3+7776*t_0*t_1*d_0*d_1^2*d_2^3-4860*t_1^2*d_0*d_1^2*d_2^3+3888*t_0*t_2*d_0*d_1^2*d_2^3+1944*t_1*t_2*d_0*d_1^2*d_2^
      3-2916*t_2^2*d_0*d_1^2*d_2^3-1944*t_0^2*d_1^3*d_2^3+1944*t_0*t_1*d_1^3*d_2^3-972*t_1^2*d_1^3*d_2^3+1944*t_0*t_2*d_
      1^3*d_2^3-972*t_2^2*d_1^3*d_2^3-972*t_0^2*d_0^2*d_2^4+1944*t_0*t_1*d_0^2*d_2^4-972*t_1^2*d_0^2*d_2^4-1944*t_0^2*d_
      0*d_1*d_2^4+3888*t_0*t_1*d_0*d_1*d_2^4-1944*t_1^2*d_0*d_1*d_2^4-972*t_0^2*d_1^2*d_2^4+1944*t_0*t_1*d_1^2*d_2^4-972
      *t_1^2*d_1^2*d_2^4+2916*d_0^4*d_1^3+2916*d_0^3*d_1^4+8748*d_0^4*d_1^2*d_2+17496*d_0^3*d_1^3*d_2+8748*d_0^2*d_1^4*d
      _2+8748*d_0^4*d_1*d_2^2+29160*d_0^3*d_1^2*d_2^2+29160*d_0^2*d_1^3*d_2^2+8748*d_0*d_1^4*d_2^2+2916*d_0^4*d_2^3+
      17496*d_0^3*d_1*d_2^3+29160*d_0^2*d_1^2*d_2^3+17496*d_0*d_1^3*d_2^3+2916*d_1^4*d_2^3+2916*d_0^3*d_2^4+8748*d_0^2*d
      _1*d_2^4+8748*d_0*d_1^2*d_2^4+2916*d_1^3*d_2^4

i38 : exit

Process M2 finished
